import React from "react";
import Table_Form from "../Tabel_Form";
import "./MinorEnglish.css";
import MinorTableMar from "./MinorTableMar";
import SignaturePad from "../SignaturePad";

function MinorEnglish() {
    return (
        <div className="consent-form">
            <h2 className="title" >
                श्रद्धा हॉस्पिटल, दौंड
            </h2>
            <h3 className="title">
                लघु शस्त्रक्रियेसाठी संमतीपत्र
            </h3>
            <Table_Form />
            <p className="paragraph">
               माझ्यावर / माझ्या रुग्णावर <span><SignaturePad width={300} height={35} design="line"/></span> पुढे नमूद केलेली प्रक्रिया करण्याकरिता 
               <span><SignaturePad width={250} height={35} design="line"/></span> तसेच त्यांच्या सहकाऱ्यांना संमती देत आहे. या प्रक्रियेबद्दल खालील माहिती मला देण्यात आलेली आहे.
            </p>
            <ol className="paragraph">
                <li>
                    प्रक्रियेचे स्वरूप.
                </li>

                <li>
                    त्यासंबंधित धोके उदा. वेदना, व्रण, रक्तस्त्राव, जंतुसंसर्ग इत्यादी.
                </li>

                <li>
                    यामुळे होणारी सुधारणा व फायदे.
                </li>

                <li>
                    सद्यस्थिती सुधारण्यासाठी लागणारा अवधी.
                </li>

                <li>
                    संबंधित उपचारामध्ये उपलब्ध विविध पर्याय व त्यांचे संभाव्य धोके याबद्दलची माहिती तसेच उपचार न केल्यास होणाऱ्या परिणामांची माहिती मला दिलेली आहे.
                </li>
            </ol>
            <p className="paragraph">
                मी नमूद करतो / करते की
            </p>
            <ul className="paragraph">
                <li>
                    माझी / माझ्या रुग्णाची सद्य वैद्यकीय स्थिती, सुचविण्यात आलेली प्रक्रिया, उपलब्ध विविध पर्याय व संभाव्य धोक्यांबद्दल डॉक्टरांना प्रश्न
                    विचारण्याची संधी मला देण्यात आली आहे. माझ्या प्रश्नांची संपूर्णतः समाधानकारक उत्तरे देण्यात आलेली आहेत.
                </li>
                <li>
                    उपचाराचे, भूल देण्याचे तसेच माझ्या / माझ्या रुग्णाच्या प्रकृतीसंबंधित धोके तसेच उपचार न केल्यास होणाऱ्या संभाव्य धोक्यांची कल्पना मला दिली आहे.
                </li>
                <li> 
                    संबंधित उपचारामध्ये उपलब्ध विविध पर्याय व त्यांचे संभाव्य धोके याबद्दलची माहिती मला दिलेली आहे.
                </li>
                <li>
                    मी सदर प्रपत्राद्वारे Dr. KAPIL DESHMUKH व त्यांच्या इतर सहाय्यक वैद्यांना माझ्यावरील वर नमूद प्रक्रिया योग्य भूलेमध्ये करण्यासाठी आणि आवश्यकतेनुसार शस्त्रक्रियेदरम्यान 
                    रक्त वा रक्तघटक देण्याची स्वेच्छेने संमती देत आहे.
                </li>
                <li>
                    मला व नातेवाईकांना सांगितलेले उपचार व प्रक्रियेचे संभाव्य सौम्य / मध्यम / तीव्र प्रकारचे जीवितास धोके (मृत्यू) मला मान्य आहेत.
                </li>
                <li>
                    तज्ज्ञ चिकित्सकाने योग्य त्या मार्गदर्शक तत्त्वानुसार ही प्रक्रिया व उपचार केले तरी त्यांच्या परिणामांची खात्री देता येणार नाही.
                </li>
                <li>
                    शस्त्रक्रिया करताना काढलेले अवयव, पेशी वा इतर नमुने यांचा पुढील तपासणी करून निदान व उपचारासाठी उपयोग होईल. 
                    हे नमुने योग्य रीतीने साठवले जातील किंवा रुग्णाला परत केले जातील अथवा योग्यरीत्या नष्ट केले जातील.
                </li>
                <li>
                    सदरच्या संमतीपत्रावर मी स्वेच्छेने व कुणाच्याही दबावाखाली न येता सही करत आहे.
                </li>
            </ul>

            <MinorTableMar/>


         
        </div>
    )
}

export default MinorEnglish;