import React from "react";
import SignaturePad from "../SignaturePad";
import "../Minor_Surgical/MinorEnglish.css"

function VenousMar() 
{
    return(
        <div>
            <p>
                मी नमूद करतो/करते की :
                <ul> 
                    <li> 
                        सदर संमतीपत्र वाचून व समजून घेण्यासाठी मला पुरेसा वेळ देण्यात आलेला आहे. 
                    </li> 
                    <li> 
                        माझी / माझ्या रुग्णाची सध्याची वैद्यकीय स्थिती, अपरिचित वैद्यकीय परिभाषा, सुचविण्यात आलेली शस्त्रक्रिया, 
                        उपलब्ध पर्याय, त्यांचे फायदे व संभाव्य धोके याबाबत डॉक्टरांना प्रश्न विचारण्याची संधी मला देण्यात आली आहे 
                        आणि माझ्या सर्व शंका व प्रश्नांची समाधानकारक उत्तरे देण्यात आली आहेत. 
                    </li> 
                    <li> 
                        वरील मजकूर मला समजेल अशा भाषेत तसेच आवश्यक त्या ठिकाणी रेखाचित्रांच्या साहाय्याने समजावून सांगण्यात आला असून तो मला पूर्णपणे समजला आहे. 
                    </li> 
                    <li> 
                        मला / माझ्या नातेवाईकांना सांगितलेले उपचार व शस्त्रक्रियेचे संभाव्य फायदे तसेच शस्त्रक्रियेदरम्यान उद्भवू शकणारे सौम्य, मध्यम किंवा तीव्र स्वरूपाचे जीवितास 
                        धोके (मृत्यूसह) मला मान्य आहेत. 
                    </li> 
                    <li> 
                        तज्ञ चिकित्सकाने योग्य त्या मार्गदर्शक तत्त्वांनुसार उपचार केले तरी त्यांच्या परिणामांची हमी देता येणार नाही, याची मला पूर्ण जाणीव आहे. 
                    </li> 
                    <li> 
                        वरील नमूद शस्त्रक्रिया किंवा त्यानंतर उद्भवणाऱ्या संभाव्य दुष्परिणामांसाठी मी रुग्णालय, वैद्यकीय अधिकारी किंवा सहाय्यक वैद्यकीय अधिकारी यांना जबाबदार धरणार नाही. 
                    </li> 
                    <li> 
                        सदर संमतीपत्रावर मी पूर्णतः स्वेच्छेने व कोणत्याही दबावाखाली न येता स्वाक्षरी करीत आहे. 
                    </li> 
                  
                   
                </ul>
                मी या संमतीपत्राद्वारे डॉ. <span><SignaturePad width={300} height={40} design="line"/></span> तसेच त्यांच्या सहाय्यक डॉक्टरांना वरील नमूद शस्त्रक्रिया करण्यास माझी संमती देत आहे. 
            </p>
        </div>
    )
}

export default VenousMar;