import React from "react";
import SignaturePad from "../CommonCode/SignaturePad";
import Table_Form from "../CommonCode/Tabel_Form";
import "../CommonCode/FormBasic.css";
import PatientDeclaration from "./PatientDeclaration";



function OTMar() {


    return (
        <div className="consent-form">
            <h2 className="title" >
                श्रद्धा हॉस्पिटल, दौंड
            </h2>
            <h4 className="title">
                OT संमतीपत्र
            </h4>

            <Table_Form />
            <div>
                <p className="paragraph">
                    मी <span><SignaturePad width={300} height={30} design="line" /></span> <br />
                    माझेवर / माझे <span><SignaturePad width={600} height={30} design="line" /></span> <br />
                    या शस्त्रक्रियेसाठी होणाऱ्या व औषधोपचार / तपासण्या / भूल उपचार पद्धतीकरिता पुढीलप्रमाणे माझे संमतीपत्र देत आहे.
                    <ol className="paragraph">
                        <li>
                            सदर औषधोपचार / तपासण्या / शस्त्रक्रिया / उपचार पद्धतीची आवश्यकता न केल्यास होणारे परिणाम, ऑपरेशनखेरीज अन्य उपचारांमधील धोके व तोटे हे सर्व मला डॉ.
                            <span><SignaturePad width={300} height={30} design="line" /></span>  यांनी समजावून दिले आहेत.
                        </li>

                        <li>
                            कोणतीही शस्त्रक्रिया संपूर्णतः सुरक्षित नसते व औषधोपचार / तपासण्या / शस्त्रक्रिया / उपचार पद्धती वा भुलेमुळे जीवाला धोका वा इजा होण्याची
                            शक्यता सर्वसाधारणपणे निरोगी असणाऱ्या व्यक्तीस सुद्धा असते याची मला स्वच्छ कल्पना दिली गेली आहे.
                        </li>

                        <li>
                            जास्त रक्तस्त्राव, जंतुबाधा, हृदय बंद पडणे व फुफ्फुसातील रक्तवाहिनीमध्ये रक्ताची गुठळी अडकणे हे व यांसारखे अकल्पित / आकस्मिक
                            इतरही काही धोके शस्त्रक्रियेतून वा भूल देण्यातून उद्भवू शकतात याची कल्पना मला डॉक्टरांनी दिली आहे.
                        </li>

                        <li>
                            औषधोपचार / तपासण्या / शस्त्रक्रिया / उपचार पद्धती करताना डॉक्टरांना काही कारणाने शस्त्रक्रिया वा भुलेचे स्वरूप बदलावे लागले तर, तसेच अत्यावश्यक वाटल्यास एखादा अवयव वा भाग
                            काढून टाकावा लागल्यास, अशा बदलास माझी संमती गृहीत आहे व तशी कल्पना डॉक्टरांनी दिली आहे.
                        </li>

                        <li>
                            शस्त्रक्रिया व भूल यांच्यानंतर क्वचित फायदा होण्याऐवजी अन्य त्रास चालू होऊ शकतो. <br />
                            उदा. :
                            <SignaturePad width={700} height={30} design="line" />

                        </li>

                    </ol>

                    <br />

                    परंतु तो टाळण्यासाठी व झाल्यास सुधारण्यासाठी आवश्यक ती काळजी, <br />

                    डॉक्टर (सर्जन) <SignaturePad width={300} height={30} design="line" />

                    व डॉक्टर (भूलतज्ज्ञ)  <SignaturePad width={300} height={30} design="line" />

                    तसेच जरूर वाटल्यास ते सांगतील ते इतर डॉक्टर घेतील याचा मला विश्वास आहे. संभाव्य धोक्याची मला कल्पना दिली आहे.

                    घोषणा

                    वरील सर्व मजकूर मी वाचला आहे / मला वाचून दाखविण्यात आला असून मला तो समजला आहे व त्यास माझी संपूर्ण मान्यता आहे.
                </p>

                <PatientDeclaration/>
            </div>
        </div>
    )
}

export default OTMar;