import React from "react";
import SignaturePad from "../CommonCode/SignaturePad";
import Table_Form from "../CommonCode/Tabel_Form";
import "../CommonCode/FormBasic.css";
import DeclarationMedicalProcess from "./DeclarationMedicalProcess";


function MedicalProcessRule() {
    return (
        <div className="consent-form">
            <h2 className="title" >
                श्रद्धा हॉस्पिटल, दौंड
            </h2>
            <h4 className="title">
                मेडिक्लेमची प्रक्रिया व नियम
            </h4>

            <Table_Form />
            <div>
                <p className="paragraph">
                    <ol>
                        <li>
                            साधारणपणे ३ प्रकारच्या विमा पॉलिसी असतात :
                            <ol>
                                <li>वैयक्तिक पॉलिसी</li>
                                <li>कॉर्पोरेट पॉलिसी</li>
                                <li>जनता पॉलिसी</li>
                            </ol>
                            आणि त्याची कव्हर रक्कम त्यानुसारच विमा कंपनी हॉस्पिटल खर्चाची जबाबदारी घेते.
                        </li>

                        <li>
                            हॉस्पिटलच्या मेडिक्लेम विभागाला संपर्क साधून मेडिक्लेमच्या कागदपत्रांची पूर्तता तसेच माहिती देणे वा घेण्याची जबाबदारी ही रुग्णाच्या नातेवाईकांवर असते. तसेच आवश्यक कागदपत्रे वेळोवेळी उपलब्ध करून देण्यासही रुग्णाचे नातेवाईक जबाबदार राहतील.
                            <ol>
                                <li>विमा पॉलिसी पेपर</li>
                                <li>मेडिक्लेम कॅशलेस कार्ड</li>
                                <li>आधार कार्ड</li>
                                <li>पॅन कार्ड</li>
                            </ol>
                        </li>

                        <li>
                            विमा कंपनीच्या नियमानुसार पेशंटला प्राथमिक स्वरूपात जनरल रूममधील बेडची व्यवस्था करून देण्यात येते. विमा कंपनीकडून क्लेमला प्राथमिक मंजुरी मिळाल्यानंतर विमा कंपनीच्या निर्देशानुसार रूमची व्यवस्था करून देण्यात येते. याव्यतिरिक्त जर रूम प्रकार बदलून हवा असल्यास त्यावरील फरक रक्कम जमा करावी लागेल.
                        </li>

                        <li>
                            पेशंटला कन्सल्टंट डॉक्टरांनी तपासल्यानंतर, पेशंटच्या आजाराची प्राथमिक माहिती, उपचाराची पद्धत, पेशंटचा अंदाजे हॉस्पिटलमधील निवासकाल व अंदाजित खर्च याची माहिती हॉस्पिटलकडून तुमच्या विमा कंपनीला पाठवण्यात येते. विमा कंपनीकडून साधारणतः २४ तासांत प्राथमिक क्लेम मंजुरी येते.
                        </li>

                        <li>
                            उपचार पूर्ण झाल्यानंतर डॉक्टर डिस्चार्ज सांगतात, पण मेडिक्लेमची प्रक्रिया अंतिम मंजुरीसाठी पाठवणे बाकी असल्याने पेशंटला डिस्चार्ज देता येत नाही.
                        </li>

                        <li>
                            डॉक्टरांनी डिस्चार्ज सांगितल्यानंतर पेशंटचे मेडिकल बिल तयार करण्यात येते व पेशंटची औषधोपचाराची कागदपत्रे, विविध तपासण्यांचे रिपोर्ट व मेडिकल बिल विमा कंपनीकडे अंतिम मंजुरीसाठी पाठवण्यात येते. मेडिक्लेमची मंजुरी साधारणतः कागदपत्रे पाठवल्यानंतर पाच तासांत मिळते. (काही प्रकरणात उशीर होऊ शकतो.)
                        </li>

                        <li>
                            काही प्रकरणात विमा कंपनीकडून अतिरिक्त कागदपत्रांची मागणी (Query) केली जाऊ शकते. तिची पूर्तता होईपर्यंत पेशंटचा डिस्चार्ज करता येत नाही. विमा कंपनीकडून अंतिम मंजुरी आल्यानंतरच पेशंटला घरी जाऊ दिले जाते.
                        </li>

                        <li>
                            काही प्रकरणात पेशंटला बिलाच्या काही प्रमाणात (Co-Payment) पैसे द्यावे लागतात. हे तुमच्या पॉलिसीच्या स्वरूपानुसार असते.
                        </li>

                        <li>
                            विमा कंपन्या नॉन-मेडिकल वस्तूंचे (Surgical) बिल मंजूर करत नाहीत. ते पैसे पेशंटला स्वतः भरावे लागतात. त्याबाबत कोणताही वाद घालू नये व बिलात समाविष्ट करून घेण्यासाठी आग्रह धरू नये.
                        </li>

                        <li>
                            क्लेम मंजूर करणे, अंशतः मंजूर करणे किंवा नामंजूर करणे हे विमा कंपनीच्या अखत्यारीतील बाब आहे. त्यामध्ये हॉस्पिटलचा कोणताही संबंध नसतो.
                        </li>

                        <li>
                            काही कारणांनी विमा कंपनीकडून मेडिक्लेम नामंजूर झाल्यास हॉस्पिटल बिलाची संपूर्ण रक्कम भरण्याची जबाबदारी पेशंटची असेल.
                        </li>

                        <li>
                            माझे लागतील ते सर्व डॉक्युमेंट्स <span><SignaturePad width={300} height={30} design="line"/></span> या कंपनीला किंवा त्या कंपनीच्या अधिकाऱ्याला देण्यास माझी काही हरकत नाही.
                        </li>
                    </ol>
                    <br /><br />
                    <strong>
                        वरील सूचना व प्रक्रिया मी वाचलेल्या आहेत व समजावून घेतलेल्या आहेत व मला मान्य आहेत.
                    </strong>
                    <br /><br />
                    <DeclarationMedicalProcess/>
                </p>


            </div>

        </div>

    )
}

export default MedicalProcessRule;