import React from "react";
import SignaturePad from "../CommonCode/SignaturePad";

function InformMoreInfoMar() {
    return (
        <div>
            <div>
                <p className="paragraph">
                    <ul style={{ listStyleType: "square" }} className="paragraph">
                        <li>
                            माझ्या आजारासंबंधित तसेच शस्त्रक्रियेसंबंधी आणि त्यानंतर होणाऱ्या गुंतागुंतीबद्दल मला समजेल अशा सोप्या भाषेत 
                            माझ्यावर शस्त्रक्रिया करणारे डॉ. <span><SignaturePad width={300} height={30} design="line" /></span>
                             यांनी समजावून सांगितले आहे. तसेच मी विचारलेल्या 
                            सर्व प्रश्नांची उत्तरे आणि इतर विषयांवर डॉक्टरांनी माझे समाधान होईपर्यंत चर्चा केली आहे. 
                            शस्त्रक्रिया न केल्यास होणारे धोके डॉक्टरांनी मला समजावून सांगितले आहेत.
                        </li>

                        <li>
                            डॉक्टरांनी मला समजावून सांगितले की, शस्त्रक्रियेदरम्यान काही गुंतागुंत किंवा धोका निर्माण झाल्यास त्यासंबंधी तात्काळ उपचार केले जातील.
                        </li>

                        <li>
                            मला समजावून सांगितले की, शस्त्रक्रियेदरम्यान अथवा त्यानंतर काही अनपेक्षित गुंतागुंत लक्षात आल्यास त्यासाठी दुसरी शस्त्रक्रिया किंवा 
                            कार्यपद्धती ठरलेल्यापेक्षा वेगळी करण्याची गरज पडू शकते.
                        </li>

                        <li>
                            मला समजावून सांगितले की, शस्त्रक्रियेदरम्यान रक्त किंवा रक्तघटक देण्याची गरज भासू शकते.
                        </li>

                        <li>
                            डॉक्टरांनी मला इतर उपचारांबद्दल आणि त्यामध्ये असणाऱ्या धोक्यांबद्दल माहिती दिली आहे.
                        </li>

                        <li>
                            मला कल्पना देण्यात आली आहे की, शस्त्रक्रियेदरम्यान एखादा अवयव अथवा त्याचा भाग काढण्यात आल्यास, त्याची तपासणी 
                            करण्याकरिता तो काही काळ ठेवण्यात येईल आणि त्यानंतर उपचार करणाऱ्या डॉक्टरांकडून अथवा वैद्यकीय क्षेत्रात कार्यरत असलेल्या 
                            व्यक्तीकडून योग्य प्रकारे विल्हेवाट लावण्यात येईल.
                        </li>

                        <li>
                            मला समजावून सांगितले की, शस्त्रक्रियेदरम्यान काही फोटो अथवा चित्रीकरण वैद्यकीय शिक्षणाकरिता अथवा 
                            संशोधनाकरिता काढण्यात येऊ शकते.
                        </li>

                        <li>
                            मला सांगण्यात आलेले पर्यायी उपलब्ध उपचार असे की :
                            <br />
                            <SignaturePad width={700} height={30} design="line"/>
                            <SignaturePad width={700} height={30} design="line"/>
                        </li>

                        <li>
                            शस्त्रक्रिया धोका / गुंतागुंत जी मला सांगण्यात आली आहेत. त्यातील काही महत्त्वाच्या बाबी अशा की :
                            <br />
                            <SignaturePad width={700} height={30} design="line"/>
                            
                        </li>

                        <li>
                            शस्त्रक्रियेसंबंधी गुंतागुंत जी मला समजावण्यात आली आहे, ती अशी की :
                            <br />
                            <SignaturePad width={700} height={30} design="line"/>
                        </li>

                        <li>
                            शस्त्रक्रियेअंती परिणाम याबद्दल मला कुठल्याही प्रकारची खात्री देण्यात आलेली नाही.
                        </li>

                        <li>
                            मला काही / सर्व प्रश्न विचारण्याची संधी देण्यात आली आहे आणि मी त्याबद्दल समाधानी आहे. 
                            शस्त्रक्रियेदरम्यान अथवा त्यानंतर होणाऱ्या गुंतागुंतीत अथवा धोक्यांत संबंधित व्यक्ती (रुग्णालये, डॉक्टर आणि परिचारिका) यांना जबाबदार धरणार नाही.
                        </li>

                        <li>
                            मी येथे प्रमाणित करतो / करते की, मला देण्यात आलेली सर्व माहिती मी वाचलेली आहे आणि मला शस्त्रक्रियेसंबंधी गरज, 
                            उपलब्ध उपचार आणि त्यासंबंधी असलेले धोके, गुंतागुंत व होणारे परिणाम समजले आहेत.
                        </li>

                        <li>
                            मी <span><SignaturePad width={300} height={30} design="line" /></span> येथे प्रमाणित करतो / करते की, 
                            डॉ. <span><SignaturePad width={300} height={30} design="line" /></span>(आणि संबंधित व्यक्ती अथवा त्यांचे सहकारी) 
                            यांना उपचार अथवा शस्त्रक्रिया करण्यास परवानगी देत आहे. 
                            प्रक्रिया / शस्त्रक्रिया आणि काही अतिरिक्त शस्त्रक्रिया अथवा उपचार सदर शस्त्रक्रियेदरम्यान करण्यासही परवानगी देत आहे.
                        </li>

                        <li>
                            मी शस्त्रक्रियेसाठी लागणारी सर्व प्रकारची भूल देण्यास डॉक्टरांना सहमती देत आहे.
                        </li>

                        <li>
                            मी डॉक्टरांना सदर उपचार / शस्त्रक्रिया किंवा अवयव काढण्याबाबत अथवा छायाचित्रणासंबंधी, जे वैद्यकीय शिक्षण अथवा संशोधनासाठी उपयुक्त आहेत, करण्यास सहमती देत आहे.
                        </li>

                        <li>
                            शस्त्रक्रियेदरम्यान मी डॉक्टरांना पूर्ण सहकार्य करेन याची मी सहमती देतो. शस्त्रक्रियेनंतर जेवणासंबंधी, औषधासंबंधी अथवा इतर कोणत्याही बाबतीत मी डॉक्टरांचा सल्ला घेईन.
                        </li>

                        <li>
                            शस्त्रक्रियेदरम्यान काही अनपेक्षित घडल्यास त्यास मी डॉक्टर अथवा हॉस्पिटल यांना जबाबदार धरणार नसल्याची सहमती देतो.
                        </li>
                    </ul>
                </p>
            </div>
        </div>

    )
}

export default InformMoreInfoMar;





