import React from "react";
import Table_Form from "../Tabel_Form";
import SignaturePad from "../SignaturePad";
import "../Minor_Surgical/MinorEnglish.css";
import DeclarationColonscopyGastroscopy from "../Common_Code/DeclarationColonscopyGastroscopy";



function ColonoscopyMar() {
    return (
        <div className="consent-form">
            <h2 className="title" >
                श्रद्धा हॉस्पिटल, दौंड
            </h2>
            <h4 className="title">
                मोठे आतडे व गुदाशयाची तपासणी (Colonoscopy) करण्याकरिता संमतीपत्र
            </h4>

            <Table_Form />
            <div>
                <p className="paragraph">
                    कोलोनोस्कोपी प्रक्रियेदरम्यान किंवा त्यानंतर पुढीलपैकी काही गुंतागुंत होण्याची शक्यता असते : <br />
                    <b>1)आतड्याला भोक पडणे.</b> <br /> <b>2)रक्तस्त्राव होणे.</b> <br />
                    <b>3)अपूर्ण तपासणी  (सुमारे १०% रुग्णांमध्ये काही कारणांमुळे तपासणी पूर्ण होऊ शकत नाही).</b>
                </p>

                <ul className="paragraph">
                    <li>रुग्णाची सध्याची वैद्यकीय स्थिती, पूर्वानुमान व वैद्यकीय सल्ल्यानुसार होणाऱ्या विविध निदानांबाबत आम्हास समजावून सांगितले आहे.</li>

                    <li>तपासणीदरम्यान व त्यानंतर दुसऱ्या / अन्य रोगाचे निदान होऊ शकते. तसेच तपासणीदरम्यान तो आजार शस्त्रक्रियेने बरा न होणारा किंवा प्रगत अवस्थेतील आजार असल्याचे आढळू शकते.</li>

                    <li>भविष्यात हा आजार पुन्हा उद्भवण्याची किंवा मूळ स्थानातून शरीराच्या दुसऱ्या भागात / अवयवात पसरण्याची काही प्रमाणात शक्यता असते.</li>

                    <li>वरील नमूद प्रक्रियेसंबंधित धोके व उपद्रव उद्भवल्यास (जे पूर्वीपासून असलेल्या आजारांमुळे अधिक तीव्र होऊ शकतात किंवा वाढू शकतात), औषधे देण्यासाठी मोठ्या रक्तवाहिनीद्वारे उपचार करावे लागू शकतात, अतिदक्षता विभागात (ICU) दीर्घकाळ ठेवावे लागू शकते किंवा कृत्रिम श्वसन उपचाराची आवश्यकता भासू शकते.</li>

                    <li>हे उपचार चालू असताना अचानक माझ्या / माझ्या रुग्णाच्या जीवाला धोका निर्माण झाल्यास, रुग्णाचा जीव वाचविण्यासाठी सर्वतोपरी प्रयत्न केले जातील.</li>

                    <li>वैद्यकीय व सहाय्यक वैद्यकीय कर्मचारी रुग्णाच्या हितासाठी त्यांचे ज्ञान, कौशल्य व अनुभव यांचा योग्य व कार्यक्षम वापर करतील.</li>

                    <li>वरील मजकूर मला समजेल अशा भाषेत समजावून सांगितला असून तो मला पूर्णपणे समजला आहे.</li>

                    <li>वरील नमूद प्रक्रियेदरम्यान किंवा त्यानंतर होणाऱ्या संभाव्य दुष्परिणामांसाठी मी रुग्णालय, वैद्य किंवा सहाय्यक वैद्यकीय कर्मचाऱ्यांना जबाबदार धरणार नाही.</li>

                    <li>सदर संमतीपत्रावर मी पूर्णतः स्वेच्छेने व कोणाच्याही दबावाखाली न येता स्वाक्षरी करीत आहे.</li>

                    <li>मी सदर संमतीपत्राद्वारे डॉ. कपिल देशमुख व त्यांच्या इतर सहाय्यक डॉक्टरांना वरील नमूद प्रक्रियेसाठी संमती देत आहे.</li>
                </ul>

                <DeclarationColonscopyGastroscopy />

            </div>
        </div>
    )
}

export default ColonoscopyMar;













