import React from "react";
import SignaturePad from "../CommonCode/SignaturePad";
import "../CommonCode/FormBasic.css";
import DeclarationInfo from "./DeclarationInfo";



function RulesCondition() {
    return (
        <div>
            <b className="title" style={{display:"block"}}>
                SHRADDHA HOSPITAL AND ICU चे नियम व अटी
            </b>
            <div>
                <p className="paragraph">
                    <ol>
                        <li>
                            मी रुग्ण / रुग्णाचे नातेवाईक <span><SignaturePad width={300} height={30} design="line"/></span> मान्य करतो / करते की रुग्णालयामध्ये रुग्णाला भेटण्याच्या वेळा व इतर महत्त्वाच्या बाबींविषयी असणारे नियम व कायद्याचे पालन करू. 
                            नियमांचे उल्लंघन होणार नाही याची काळजी घेऊ.
                        </li>

                        <li>
                            रुग्णालयाच्या नियमानुसार मी / रुग्णाचे आधार कार्ड / पॅन कार्ड / पासपोर्ट / मतदार ओळखपत्र हे ओळख पुरावा म्हणून सादर करेन.
                        </li>

                        <li>
                            मी रुग्ण / रुग्णाचे नातेवाईक विमा कंपनी अथवा टीपीए कंपनी किंवा इतर मेडिक्लेम इन्शुरन्सबाबत रुग्णालयाला पहिल्याच दिवशी माहिती देईन.
                        </li>

                        <li>
                            काही तपासण्यांसाठी रुग्णाला रुग्णालयाव्यतिरिक्त इतर ठिकाणी नेण्याची आवश्यकता भासल्यास व डॉक्टरांनी सांगितल्यास माझ्या जबाबदारीवर रुग्णाला घेऊन जाईन. रुग्णालयाबाहेर होणाऱ्या परिणामांसाठी मी स्वतः जबाबदार राहीन.
                        </li>

                        <li>
                            मी रुग्ण / रुग्णाचे नातेवाईक रुग्णाजवळ असलेल्या मौल्यवान वस्तू, दागिने व पैसे यांची काळजी घेईन व त्याची पूर्ण जबाबदारी माझी राहील.
                        </li>

                        <li>
                            रुग्णाची तब्येत कधीही अत्यवस्थ होऊ शकते याची मला जाणीव आहे. त्यासाठी आवश्यक असल्यास कधीही आय.सी.यू. मध्ये दाखल करण्यास मी परवानगी देत आहे.
                        </li>

                        <li>
                            गरज पडल्यास इतर तज्ज्ञ डॉक्टरांची मदत घेण्यास मी परवानगी देत आहे. त्यांची स्वतंत्र फी देण्यास माझी तयारी असेल.
                        </li>

                        <li>
                            <b>SHRADDHA HOSPITAL AND ICU</b> येथे उपलब्ध असलेल्या सुविधांची मला पूर्ण कल्पना आहे. येथे काही सेवा उपलब्ध नसल्यास व रुग्णाच्या उपचारासाठी आवश्यकता भासल्यास इतर रुग्णालयात हलविण्यास माझी पूर्ण संमती असेल.
                        </li>

                        <li>
                            रुग्णालयाच्या बिलाविषयीची पूर्ण माहिती मी स्वतः जाणून घेईन व त्यानुसार बिल भरण्याची माझी / आमची तयारी असेल.
                        </li>

                        <li>
                            मी / रुग्णाने वैद्यकीय सल्ल्याविरुद्ध डिस्चार्ज घेण्याची मागणी केल्यास त्यासंबंधित संमतीपत्रावर माझी / रुग्णाची स्वाक्षरी करणे बंधनकारक राहील.
                        </li>

                        <li>
                            रुग्णासोबत रात्री ९ वाजेपासून सकाळी ८ वाजेपर्यंत फक्त एकच नातेवाईक / काळजीवाहक थांबेल याची मी खबरदारी घेईन.
                        </li>

                        <li>
                            रुग्णाने किंवा रुग्णाच्या नातेवाईकांनी रुग्णालयात असभ्य वर्तन, गैरवर्तन, शिवीगाळ, दमदाटी, तोडफोड किंवा इतर कोणतेही नुकसान केल्यास त्याची नुकसानभरपाई करण्याची संपूर्ण जबाबदारी रुग्णाची / रुग्णाच्या नातेवाईकाची राहील.
                        </li>
                    </ol>
                </p>
            </div>

        </div>

    )
}

export default RulesCondition;