import React from "react";
import SignaturePad from "../CommonCode/SignaturePad";
import "../CommonCode/FormBasic.css";

function TransfusionBloodMoreInfoMar() {
    return (
        <div>
            <p className="paragraph">
                रक्तसंक्रमण ही एक जीवनदान देणारी वैद्यकीय प्रक्रिया आहे. रक्त हे पूर्ण रक्त (Whole Blood) अथवा रक्तघटकांच्या
                स्वरूपात (Components) दिले जाते. उदा. लाल रक्तपेशी (Red Blood Cells), प्लेटलेट्स (Platelets),
                प्लाझ्मा (Plasma) आणि क्रायोप्रेसिपिटेट (Cryoprecipitate).
                <ol>
                    <li>मला / माझ्या रुग्णाला रक्तसंक्रमणाचे सर्व उपलब्ध पर्याय आणि / किंवा रक्तघटकांच्या संक्रमणाचे अपेक्षित लाभ समजावून सांगितले आहेत.</li>

                    <li>मी / माझ्या रुग्णाला वैद्यकीय देखरेखीखाली रक्त / रक्तघटकांच्या वापरास संमती देत आहे.</li>

                    <li>मला / माझ्या रुग्णाला हे माहित आहे की, ज्याचा वापर केला जाणार आहे ते रक्त / रक्तघटक या संबंधातील राष्ट्रीय निर्देशानुसार तयार केले व तपासलेले आहेत. तथापि यानंतरही एखाद्या छोट्या प्रतिक्रियेची (Reaction) शक्यता नाकारता येत नाही जसे - थंडीताप किंवा नुसता ताप, खाज सुटणे. यावर उपचार होऊ शकतात. अगदीच क्वचित प्रसंगी जीवाला धोका उत्पन्न होईल अशीही स्थिती येऊ शकते, याची मला माहिती देण्यात आली आहे.</li>

                    <li>मला / माझ्या रुग्णाला हे सूचित करण्यात आले आहे की, प्रत्येक रक्तपिशवीवर एच.आय.व्ही., हिपेटायटीस बी व सी, मलेरिया व सिफिलीस या आजारांच्या तपासण्या करूनच रक्तपिशवी दिली जाते. तरीसुद्धा हे आजार रक्तसंक्रमणाद्वारे होणारच नाहीत अशी हमी देता येऊ शकत नाही.</li>

                    <li>मी / माझ्या रुग्णाचे रक्तसंक्रमण तसेच रक्तसंक्रमणाचे पर्याय, रक्तसंक्रमण न करण्यातील धोके, रक्तसंक्रमणाच्या पद्धती आणि तत्संबंधातील जबाबदारी व धोके यासंबंधी जाणून घेतले आहे.</li>

                    <li>मी / माझा रुग्ण असे मानतो की, मला / माझ्या रुग्णाला रक्त व रक्तघटकांच्या संक्रमणाच्या संमतीचा निर्णय करण्यासाठी पुरेशी माहिती देण्यात आली आहे.</li>

                    <li>मी / माझ्या रुग्णाला वरील सर्व माहिती मला / माझ्या रुग्णाला समजणाऱ्या भाषेत समजावून सांगितली आहे.</li>

                    <li>हॉस्पिटलमध्ये असताना व नंतर घरी गेल्यानंतर पेशंटला सल्ला दिलेल्या औषधोपचाराबद्दल किंवा गरज असल्यास रक्त द्यायचे असल्यास औषधे अथवा रक्त यामुळे होणाऱ्या फायद्याची तसेच नुकसानीची आम्हास संपूर्णपणे कल्पना देण्यात आलेली आहे.</li>

                    <li>रक्त / औषधे आम्ही आमच्या स्वतःच्या पसंतीच्या ठिकाणाहून आणलेले आहे.</li>

                    <li>उपलब्ध असलेल्या इतर पद्धतीचीही आम्हास पूर्ण कल्पना देण्यात आलेली आहे. सर्व प्रकारचा विचार करून आम्ही स्वतः उपचारपद्धत निवडलेली आहे व त्यास संमती दिलेली आहे.</li>
                </ol>
            </p>
        </div>
    )
}

export default TransfusionBloodMoreInfoMar;