import React from "react";
import "../CommonCode/FormBasic.css";
import SignaturePad from "../CommonCode/SignaturePad";


function UndertakingMar() {
    return (
        <div>
            <div>
                <p className="paragraph">
                    <ol className="paragraph">
                        <li>
                            डॉक्टरांनी मला / आम्हाला माझ्या / आमच्या रुग्णाच्या <span><SignaturePad width={300} height={30} design="line"/></span>प्रकृतीची आताच्या परिस्थितीची संपूर्ण माहिती व कल्पना दिली आहे.
                        </li>

                        <li>
                            मला / आम्हाला रुग्णाची प्रकृती अत्यंत चिंताजनक असल्याबद्दल पूर्ण कल्पना दिली आहे. रुग्णाच्या आजारावर केल्या जाणाऱ्या तपासण्या, उपचार व संभाव्य दुष्परिणाम, इतर धोके याबद्दल संपूर्ण माहिती दिली आहे.
                        </li>

                        <li>
                            मी / माझ्या स्वतःच्या जबाबदारीवर माझ्यावर / माझ्या रुग्णावर आवश्यक ती शस्त्रक्रिया करण्यास संमती देत आहे. त्यासाठी लागणाऱ्या भूल व शस्त्रक्रियेमुळे होऊ शकणाऱ्या विपरीत परिणामांची स्पष्ट कल्पना डॉक्टरांनी मला दिली आहे.
                        </li>

                        <li>
                            शस्त्रक्रिया चालू असताना उद्भवणाऱ्या अनपेक्षित घटनेमुळे ऑपरेशनचे स्वरूप बदलावे लागल्यास त्यास माझी संमती आहे. अगदी सुदृढ रुग्णासही ही शस्त्रक्रिया करताना अचानक श्वसनक्रिया किंवा हृदयक्रियेमध्ये अडथळा निर्माण होऊन जीवितास धोका निर्माण होऊ शकतो, याची स्पष्ट कल्पना डॉक्टरांनी मला दिली आहे.
                        </li>

                        <li>
                            या हॉस्पिटलमध्ये असलेल्या सुविधा मला / आम्हाला माहीत आहेत. काही प्रकारच्या सुविधा नसल्याची कल्पनाही मला / आम्हाला डॉक्टरांनी दिली आहे.
                        </li>

                        <li>
                            गरज भासल्यास रुग्णास अतिदक्षता विभागात ठेवण्याची माझी / आमची तयारी आहे व त्याच्या खर्चाची पूर्ण कल्पना मला / आम्हाला दिलेली आहे. त्यासाठी खर्च करण्याची माझी / आमची तयारी आहे.
                        </li>

                        <li>
                            वरील अटी मला मान्य व बंधनकारक आहेत. वरील सर्व गोष्टी मला कळत असलेल्या भाषेमध्ये सांगितल्या आहेत.
                        </li>

                        <li>
                            गरज भासल्यास रुग्णासंबंधीची माहिती, छायाचित्रे, व्हिडिओ, ऑडिओ इ. दस्तऐवज इन्शुरन्स कंपनी / टी.पी.ए. / संशोधन इ. कामांसाठी देण्यास माझी / आमची काहीही हरकत नाही.
                        </li>

                        <li>
                            <span><SignaturePad width={700} height={30} design="line"/></span>
                            <br />
                            <span><SignaturePad width={700} height={30} design="line"/></span>
                        </li>

                        <li>
                            तरी मी / आम्ही रुग्णालयाच्या अधिकाऱ्यांना मला / रुग्णास <span><SignaturePad width={300} height={30} design="line"/></span>, <b>SHRADDHA HOSPITAL AND ICU</b> येथे दाखल करून घेण्याची विनंती करतो.
                        </li>
                    </ol>
                </p>


            </div>
        </div>

    )
}

export default UndertakingMar;

