import React from "react";
import SignaturePad from "../SignaturePad";
import FormChart from "../Common_Code/FormChart";
import Table_Form from "../Tabel_Form";
import "../Minor_Surgical/MinorEnglish.css";
import DeclarationAmputation from "./DeclarationAmputation";


function AmputationMar() {
    return (
        <div className="consent-form">
            <h2 className="title" >
                श्रद्धा हॉस्पिटल, दौंड
            </h2>
            <h4 className="title">
                शस्त्रक्रिया व भुलीसंबंधित संमतीपत्र
            </h4>


            <Table_Form />

            <div>
                <b >
                    शस्त्रक्रियेचे नाव :- <br /><span><SignaturePad width={700} height={40} design="border" /></span>
                </b>
                <br /><br />
                <p className="paragraph">
                    मी माझ्या <span><SignaturePad width={300} height={30} design="line" /></span> यांच्या उजव्या / डाव्या हाताची / पायाची शस्त्रक्रिया डॉक्टरांच्या सल्ल्यानुसार योग्य त्या भूलेखाली करून घेण्यास संमती देत आहे.
                    हाताच्या / पायाच्या बोटाचा काही भाग किंवा संपूर्ण भाग तुटलेला असून जखम झालेली आहे व हाड उघडे पडलेले आहे.
                    त्या कारणास्तव उघडे पडलेल्या हाडाचा काही भाग किंवा संपूर्ण हाड काढून त्या भागास त्वचेने झाकण्याची (Covering Procedure) शस्त्रक्रिया करण्यास मी तयार आहे.
                    या शस्त्रक्रियेमुळे संबंधित बोटाची लांबी कमी होऊ शकते, याची मला कल्पना देण्यात आलेली आहे.
                    डॉक्टरांनी मला त्वचा प्रत्यारोपण (Flap Surgery) हा पर्यायी उपचार पर्याय देखील समजावून सांगितला आहे. तसेच भूल देताना किंवा भूल दिल्यानंतर काही गुंतागुंत निर्माण होऊ शकते व
                    जीवाला धोका निर्माण होण्याची शक्यता असू शकते, याचीही मला पूर्ण कल्पना देण्यात आलेली आहे.
                    वरील सर्व माहिती मला समजेल अशा भाषेत समजावून सांगण्यात आली असून ती मला पूर्णपणे समजली आहे. मी कोणत्याही दबावाखाली न येता स्वखुशीने या शस्त्रक्रियेस व आवश्यक उपचारांस संमती देत आहे.
                </p>

                <b>
                    शस्त्रक्रियेनंतर संभाव्य धोके :-
                </b>

                <ul className="paragraph"> 
                    <li>
                        जखमेमध्ये जंतुसंसर्ग होऊ शकतो.
                    </li> 
                    <li>
                        हाड टोचत राहण्याची तक्रार उद्भवू शकते.
                    </li> 
                    <li>
                        हाड पुन्हा उघडे पडणे किंवा जखम होण्याची शक्यता असते.
                    </li> 
                    <li>
                        बोटामध्ये वेदना राहणे किंवा सूज कायम राहू शकते.
                    </li> 
                    <li>
                        बोटामध्ये आग होणे, मुंग्या आल्यासारखे वाटणे (न्युरोमा – Neuroma) अशी लक्षणे दिसू शकतात.
                    </li> 
                    <li>
                        बोट पूर्ववत असल्याचा भास (Phantom Sensation) होऊ शकतो.
                    </li> 
                    <br />
                    <p className="paragraph">
                        वरील संभाव्य धोके डॉक्टरांनी मला समजेल अशा भाषेत समजावून सांगितले आहेत. तरीही मी हाडाचा उघडा भाग अथवा आवश्यक 
                        असल्यास संपूर्ण हाड काढून त्यावर त्वचेद्वारे झाकण्याची (कव्हर करण्याची) शस्त्रक्रिया करून घेण्यास स्वखुशीने संमती देत आहे.
                    </p>
                </ul>
                <DeclarationAmputation/>
            </div>

        </div>
    )
}

export default AmputationMar;