import React from "react";
import SignaturePad from "../SignaturePad";
import Table_Form from "../Tabel_Form";
import "../Minor_Surgical/MinorEnglish.css";
import DeclarationPICCBoneMarrowChemo from "../Common_Code/DeclarationPICCBoneMarrowChemo";



function ChemotherapyMar() {
    return (
        <div className="consent-form">
            <h2 className="title" >
                श्रद्धा हॉस्पिटल, दौंड
            </h2>
            <h4 className="title">
                केमोथेरपी संमतीपत्र
            </h4>


            <Table_Form />
            <div>
                <strong>
                    निदान : <span><SignaturePad width={700} height={40} design="border" /></span>
                </strong>
                <br /><br />

                <strong>
                    प्रस्तावित उपचार : <span><SignaturePad width={700} height={40} design="border" /></span>
                </strong>
                <br />
                <hr style={{
                    width: "100%",
                    border: "0",
                    borderTop: "2px solid black"
                }} />
                <br />
                <p className="paragraph">
                    <strong>उपचाराचा उद्देश :</strong><br />
                    कीमोथेरपी उपचाराचा मुख्य उद्देश रक्ताच्या कर्करोगाचे नियंत्रण करणे, त्याचा प्रसार कमी करणे किंवा थांबविणे
                    आणि रुग्णाच्या जीवनमानात सुधारणा करणे हा आहे. या उपचाराद्वारे पूर्ण बरे होण्याची हमी देता येत नाही;
                    तथापि, रोगाची लक्षणे कमी करणे,आजारावर नियंत्रण ठेवणे आणि रुग्णाचे आयुष्य व जीवनाची गुणवत्ता सुधारण्याचा प्रयत्न केला जातो.
                </p>
                <hr style={{
                    width: "100%",
                    border: "0",
                    borderTop: "2px solid black"
                }} />
                <br />

                <p className="paragraph">
                    <strong>अपेक्षित फायदे:</strong><br />
                    <ul>
                        <li>
                            मानक कीमोथेरपी उपचारांद्वारे अंदाजे <span><SignaturePad width={15} height={30} design="none" /></span> % प्रतिसाद मिळण्याची शक्यता आहे
                        </li>

                        <li>
                            रोग पुनरावृत्तीचा धोका अंदाजे <span><SignaturePad width={15} height={30} design="none" /></span>% असू शकतो
                        </li>

                        <li>
                            रोगावर नियंत्रण मिळविण्याची किंवा पूर्ण बरे होण्याची संभाव्य संधी उपलब्ध होऊ शकते.
                        </li>

                        <li>
                            न्युट्रोपेनियाशी संबंधित गुंतागुंतांमुळे मृत्यूचा धोका अंदाजे <span><SignaturePad width={15} height={30} design="none" /></span>% असू शकतो.
                        </li>
                    </ul>
                </p>

                <hr style={{
                    width: "100%",
                    border: "0",
                    borderTop: "2px solid black"
                }} />
                <br />

                <p className="paragraph">
                    <strong>संभाव्य धोके आणि दुष्परिणाम :</strong>
                    <ul>
                        <li>
                            <strong>संसर्ग :</strong> प्रतिकारशक्ती कमी झाल्यामुळे जीवाणू, बुरशीजन्य किंवा विषाणूजन्य संसर्ग होण्याचा उच्च धोका असतो.
                        </li>

                        <li>
                            <strong>ट्यूमर लायसिस सिंड्रोम :</strong> ट्यूमर वेगाने नष्ट झाल्यामुळे मूत्रपिंड निकामी होणे, इलेक्ट्रोलाइटचे असंतुलन व इतर गंभीर गुंतागुंत होऊ शकते.
                        </li>

                        <li>
                            <strong>गंभीर सायटोपेनिया :</strong> रक्तपेशींची संख्या अत्यंत कमी झाल्यामुळे संसर्ग, रक्तस्त्राव होणे किंवा अतिदक्षता विभागात (ICU) दाखल करावे लागू शकते.
                        </li>

                        <li>
                            <strong>थ्रॉम्बोसाइटोपेनिया :</strong> प्लेटलेट्सची संख्या कमी झाल्यामुळे अंतर्गत रक्तस्त्राव किंवा मेंदूमध्ये रक्तस्त्राव होण्याचा धोका असतो.
                        </li>

                        <li>
                            <strong>न्युट्रोपेनिया :</strong> पांढऱ्या रक्तपेशींची संख्या अत्यंत कमी झाल्यामुळे गंभीर संसर्ग होण्याची शक्यता वाढते.
                        </li>

                        <li>
                            <strong>अवयव विषबाधा :</strong> मूत्रपिंड (Renal Toxicity) व हृदय (Cardiotoxicity) यांच्यावर दुष्परिणाम होऊ शकतात.
                        </li>

                        <li>
                            <strong>पचनसंस्थेवरील दुष्परिणाम :</strong> तीव्र मळमळ, उलट्या, अतिसार, तोंडामध्ये व्रण (Mucositis) इत्यादी समस्या उद्भवू शकतात.
                        </li>

                        <li>
                            <strong>मेंदू व मज्जासंस्थेवरील परिणाम :</strong> मज्जासंस्थेचे विकार, हात-पाय सुन्न होणे, झिणझिण्या येणे किंवा स्मरणशक्ती कमी होण्याची शक्यता असते.
                        </li>

                        <li>
                            <strong>प्रजननक्षमतेवरील परिणाम :</strong> वंध्यत्व, अंडाशयाचे कार्य बंद होणे, लवकर रजोनिवृत्ती येणे किंवा शुक्राणूंच्या गुणवत्तेवर परिणाम होऊ शकतो.
                        </li>

                        <li>
                            <strong>इतर दुष्परिणाम :</strong> थकवा, केस गळणे (अलोपेशिया), भूक मंदावणे तसेच दुय्यम कर्करोग होण्याची शक्यता असते.
                        </li>

                        <li>
                            <strong>रुग्णालयात भरती होण्याची गरज :</strong> गंभीर गुंतागुंतीमुळे रुग्णालयात दाखल होण्याची आवश्यकता भासू शकते.
                        </li>

                        <li>
                            <strong>व्हेंटिलेटर सपोर्ट :</strong> काही गंभीर परिस्थितींमध्ये श्वसन निकामी होणे किंवा जीवघेण्या संसर्गामुळे कृत्रिम श्वसनयंत्र (Ventilator) लावण्याची आवश्यकता भासू शकते.
                        </li>

                        <li>
                            <strong>सहायक उपचार :</strong> उपचारादरम्यान रक्त संक्रमण (Blood Transfusion), प्रतिजैविके (Antibiotics), इलेक्ट्रोलाइट संतुलन राखणे तसेच अतिदक्षता विभागात (ICU) उपचारांची आवश्यकता भासू शकते.
                        </li>

                        <li>
                            <strong>विशिष्ट रुग्णासाठी संभाव्य धोके आणि गुंतागुंती :</strong> <br /> <span><SignaturePad width={700} height={30} design="line" /></span>
                        </li>
                    </ul>
                </p>

                <hr style={{
                    width: "100%",
                    border: "0",
                    borderTop: "2px solid black"
                }} />
                <br />

                <p className="paragraph">
                    <strong>उपचारानंतरची काळजी :</strong> <br />
                    उपचारानंतर रक्तपेशींची संख्या कमी असलेल्या कालावधीत घ्यावयाच्या विशेष खबरदारीच्या सूचना मला समजावून सांगण्यात आल्या आहेत.
                </p>

                <hr style={{
                    width: "100%",
                    border: "0",
                    borderTop: "2px solid black"
                }} />
                <br />

                <p>
                    <strong>
                        समजून घेणे आणि संमती :
                    </strong>
                    <ul>
                        <li>
                            आम्हाला रोगाचे स्वरूप तसेच उपचारांचे फायदे, धोके आणि संभाव्य दुष्परिणाम याबाबत सविस्तर माहिती देण्यात आली आहे.
                        </li>

                        <li>
                            आम्हाला समजले आहे की पूर्णपणे बरे होण्याची कोणतीही हमी नाही आणि या उपचाराचा उद्देश रोगावर नियंत्रण ठेवणे तसेच रुग्णाचे जीवनमान सुधारणे हा आहे.
                        </li>

                        <li>
                            आम्हाला उपचारासंबंधी प्रश्न विचारण्याची पूर्ण संधी देण्यात आली असून, आमच्या सर्व शंकांचे समाधानकारक निरसन करण्यात आले आहे.
                        </li>

                        <li>
                            खाली स्वाक्षरी करून आम्ही स्वेच्छेने कीमोथेरपी उपचारासाठी संमती देत असून, उपचाराशी संबंधित सर्व संभाव्य धोके व पूर्ण बरे होण्याची हमी नसल्याची बाब आम्ही मान्य करीत आहोत.
                        </li>
                    </ul>
                </p>
                <hr style={{
                    width: "100%",
                    border: "0",
                    borderTop: "2px solid black"
                }} />
                <br />


                <br />

                <DeclarationPICCBoneMarrowChemo
                    patientSign="रुग्णाची सही :"
                    parentName="पालक / अधिकृत प्रतिनिधीचे नाव  :"
                    parentSign="पालक / अधिकृत प्रतिनिधीचे सही :"
                    date="दिनांक :"
                    patientRelative="रुग्णाशी नाते :" />

            </div>


        </div>


    )
}

export default ChemotherapyMar;