import React from "react";
import "../CommonCode/FormBasic.css";


function CashlessMediclaimMar() {
    return (
        <div >
            <div>
                <b className="title" style={{display:"block"}}>कॅशलेस मेडिक्लेम संमतीपत्र</b>
                <br />

                <strong className="paragraph">
                    <u>
                        जर कॅशलेस मेडिक्लेम मंजूर (APPROVE) झाला नाही किंवा कमी मंजूर झाला, उर्वरित बिलाचे पैसे भरण्यासाठी संमती
                    </u>
                </strong>
                <br />
                <p className="paragraph">
                    खालील सर्व व तत्सम इतर बाबींमध्ये मी / पेशंट पैसे भरण्यास तयार आहे. त्याची संमती खाली सही करून देत आहे.
                </p>

                <ol >
                    <li>कॅशलेस मेडिक्लेम सुविधेमध्ये नॉन-मेडिकल, ॲडमिन व इतर चार्जेस फायनल मंजुरीप्रमाणे वजा करण्यात आल्यास.</li>

                    <li>इन्शुरन्स कंपनी / टीपीए कडून कॅशलेस मंजुरी न देणे किंवा कॅशलेस सुविधा नाकारणे.</li>

                    <li>कॅशलेस सुविधा नाकारून इन्शुरन्स कंपनी / टीपीए कडून रिइम्बर्समेंट (Reimbursement) करण्यास सांगितल्यास.</li>

                    <li>सुरुवातीला मंजुरी देऊन नंतर डिस्चार्जच्या वेळी कोणत्याही कारणामुळे मंजुरी नाकारल्यास.</li>

                    <li>इतर कोणत्याही कारणामुळे कॅशलेस सुविधा नाकारल्यास.</li>

                    <li>बिलाचे पेमेंट संबंधित टीपीए / इन्शुरन्स कंपनीकडून २ ते ३ महिन्यांत न झाल्यास.</li>

                    <li>कॅशलेस मंजुरी मिळाल्यानंतरही काही तांत्रिक कारणांमुळे पेमेंटबाबत संभ्रम असल्यास (Refundable Payment किंवा Security Cheque).</li>
                </ol>

            </div>

        </div>

    )
}

export default CashlessMediclaimMar;