import React from "react";
import SignaturePad from "../SignaturePad";

function IntubationMar() {
    return (
        <div>
            <p className="paragraph">
                <b>
                    रुग्ण / रुग्णाचे नातेवाईक यांचे संमतीपत्र
                </b>
                <br />
                
                डॉक्टरांनी मला समजावून सांगितलेल्या खालील बाबी मला समजल्या असून त्या मला मान्य आहेत.
                <ul>
                    <li>
                        माझ्या रुग्णाची सध्याची वैद्यकीय स्थिती, रोगाचे स्वरूप, रोगाचे भावी परिणाम व प्रतिसाद तसेच रुग्णाच्या प्रकृतीसंबंधित धोके याबद्दल मला माहिती देण्यात आली आहे.
                    </li>

                    <li>
                        माझ्या रुग्णाच्या श्वसनमार्गात अडथळा निर्माण झाल्यामुळे व रुग्णास श्वासोच्छ्वास घेण्यास त्रास होत असल्याने कृत्रिम श्वसनासाठी श्वासनलिकेत ट्यूब टाकणे आवश्यक आहे.
                    </li>

                    <li>
                        या उपचाराचे स्वरूप, हेतू व आवश्यकता, उपचाराचे परिणाम, फायदे व तोटे, उपलब्ध पर्यायी उपचारपद्धती, त्यांचे संभाव्य फायदे व धोके तसेच कृत्रिम श्वसनासाठी आवश्यक उपचार न केल्यास होणाऱ्या संभाव्य धोक्यांची मला पूर्ण कल्पना देण्यात आली आहे.
                    </li>

                    <li>
                        रुग्णाला औषधे देण्यासाठी मोठ्या रक्तवाहिनीत कॅथेटर टाकण्याची, कृत्रिम श्वासोच्छ्वास देण्याची तसेच दीर्घकाळ अतिदक्षता विभागात (ICU) ठेवण्याची आवश्यकता भासू शकते.
                    </li>
                </ul>

            </p>
            <br /><br />

            <p className="paragraph">
                <b>
                    मी नमूद करतो की,
                </b>
                <ul>
                    <li>
                        सदर संमतीपत्र वाचून व समजून घेण्यासाठी मला पुरेसा वेळ देण्यात आलेला आहे.
                    </li>

                    <li>
                        माझ्या रुग्णाची सध्याची वैद्यकीय स्थिती, अपरिचित वैद्यकीय परिभाषा, सुचविण्यात आलेल्या उपचारांचे परिणाम, फायदे व तोटे, उपलब्ध पर्याय, त्यांचे संभाव्य फायदे व धोके याबाबत डॉक्टरांना प्रश्न विचारण्याची संधी मला देण्यात आली आहे व माझ्या सर्व शंका व प्रश्नांची समाधानकारक उत्तरे देण्यात आली आहेत.
                    </li>

                    <li>
                        वरील मजकूर मला समजेल अशा भाषेत तसेच आवश्यक त्या ठिकाणी रेखाचित्रांच्या साहाय्याने समजावून सांगण्यात आला असून तो मला पूर्णपणे समजला आहे.
                    </li>

                    <li>
                        मला / आम्हाला या व पुढील उपचारांच्या अंदाजित खर्चाबाबत सर्व माहिती देण्यात आली आहे.
                    </li>

                    <li>
                        सांगितलेल्या उपचारांचे संभाव्य फायदे तसेच उपचारादरम्यान संभवणारे सौम्य, मध्यम किंवा तीव्र प्रकारचे जीवितास धोके (मृत्यूसह) मला / आम्हाला मान्य आहेत.
                    </li>

                    <li>
                        तज्ज्ञ चिकित्सकाने योग्य त्या वैद्यकीय मार्गदर्शक तत्त्वांनुसार उपचार केले तरी त्याच्या परिणामांची हमी देता येणार नाही, याची मला जाणीव आहे.
                    </li>

                    <li>
                        वरील नमूद उपचारादरम्यान किंवा त्यानंतर उद्भवणाऱ्या संभाव्य दुष्परिणामांसाठी मी रुग्णालय, वैद्यकीय अधिकारी किंवा सहाय्यक वैद्यकीय कर्मचाऱ्यांना जबाबदार धरणार नाही.
                    </li>

                    <li>
                        मी हे संमतीपत्र पूर्णपणे स्वेच्छेने व कोणत्याही दबावाखाली न येता स्वाक्षरी करून देत आहे.
                    </li>

                    <li>
                        मी या संमतीपत्राद्वारे डॉ. <span><SignaturePad width={300} height={40} design="line" /></span>  व त्यांच्या सहाय्यक डॉक्टरांना कृत्रिम श्वसनासाठी श्वासनलिकेत ट्यूब टाकणे व त्यासंबंधित आवश्यक उपचार करण्याची संमती देत आहे.
                    </li>
                </ul>
            </p>
        </div>
    )
}

export default IntubationMar;