import React from "react";
import SignaturePad from "../SignaturePad";
import Table_Form from "../Tabel_Form";
import "../Minor_Surgical/MinorEnglish.css";
import DeclarationPICCBoneMarrowChemo from "../Common_Code/DeclarationPICCBoneMarrowChemo";


function BoneMarrowMar() {
    return (
        <div className="consent-form">
            <h2 className="title" >
                श्रद्धा हॉस्पिटल, दौंड
            </h2>
            <h4 className="title">
                बोन मॅरो ऍस्पिरेशन आणि बायोप्सी प्रक्रियेसाठी संमतीपत्र
            </h4>


            <Table_Form />
            <div>

                <b >
                    निदान: <span><SignaturePad width={700} height={40} design="border" /></span>
                </b>
                <br /><br />

                <b>
                    प्रस्तावित उपचार : <span><SignaturePad width={700} height={40} design="border" /></span>
                </b>
                <br />

                <p className="paragraph">
                    मी (किंवा रुग्णाचे नातेवाईक) <span><SignaturePad width={500} height={30} design="line" /></span>,
                    डॉ.<span><SignaturePad width={300} height={30} design="line" /></span> आणि त्यांच्या सहाय्यक वैद्यकीय
                    कर्मचाऱ्यांकडून करण्यात येणाऱ्या बोन मॅरो ऍस्पिरेशन आणि बायोप्सी प्रक्रियेसाठी माझी संमती देतो/देते.
                    जर डॉ. <span><SignaturePad width={300} height={30} design="line" /></span> कोणत्याही कारणास्तव ही प्रक्रिया पूर्ण करू शकत नसतील,
                    तर योग्य पर्यायी डॉक्टर ही प्रक्रिया पूर्ण करतील.या प्रक्रियेचे स्वरूप, उद्देश, फायदे, संभाव्य धोके व गुंतागुंत याबाबतची संपूर्ण माहिती मला समजेल अशा भाषेत
                    समजावून सांगण्यात आली आहे आणि ती मला पूर्णपणे समजली आहे.
                </p>

                <b>
                    प्रदान केलेल्या माहितीमध्ये हे समाविष्ट आहे :
                </b>

                <ol className="paragraph">
                    <li>
                        <strong>प्रक्रियेचे स्वरूप :</strong>
                        अस्थिमज्जा ऍस्पिरेशन आणि बायोप्सीमध्ये अस्थिमज्जेतील पेशी (ऍस्पिरेशन) काढण्यासाठी विशेष सुईचा वापर केला जातो तसेच निदानाच्या उद्देशाने अस्थिमज्जेच्या ऊतींचा (बायोप्सी) एक छोटा नमुना घेतला जातो.
                    </li>

                    <li>
                        <strong>संबंधित धोके :</strong>
                        संभाव्य गुंतागुंतांमध्ये वेदना, रक्तस्त्राव, संसर्ग, चक्कर येणे, सूज येणे किंवा प्रक्रियेच्या ठिकाणी जळजळ होणे यांचा समावेश असू शकतो.
                    </li>

                    <li>
                        <strong>अपेक्षित फायदे :</strong>
                        ही प्रक्रिया रक्तविकार, रक्ताचा कर्करोग, अशक्तपणा तसेच इतर अस्थिमज्जेशी संबंधित आजारांचे निदान करण्यात मदत करते.
                    </li>

                    <li>
                        <strong>पुनर्प्राप्ती कालावधी :</strong>
                        मला अंदाजे पुनर्प्राप्ती कालावधी तसेच प्रक्रियेनंतर होऊ शकणाऱ्या संभाव्य दुष्परिणामांबाबत माहिती देण्यात आली आहे.
                    </li>

                    <li>
                        <strong>पर्यायी उपचार आणि धोके :</strong>
                        मला उपलब्ध पर्यायी निदान पद्धती, त्यांचे धोके तसेच ही प्रक्रिया न केल्यास होणारे संभाव्य परिणाम याबाबत माहिती देण्यात आली आहे.
                    </li>
                </ol>

                <p className="paragraph">
                    मला प्रक्रियेसंबंधी कोणतेही प्रश्न विचारण्याची संधी देण्यात आली आहे आणि माझ्या सर्व प्रश्नांची समाधानकारक उत्तरे देण्यात आली आहेत. मला समजते की ही प्रक्रिया पार पाडण्यापूर्वी मला कोणत्याही वेळी नकार देण्याचा अधिकार आहे.
                    मी स्वेच्छेने डॉ. <span><SignaturePad width={300} height={30} design="line" /></span> यांना ही प्रक्रिया करण्यासाठी तसेच माझ्या निदान व उपचारासाठी आवश्यक वाटणारे कोणतेही अतिरिक्त हस्तक्षेप करण्यास अधिकृत करीत आहे. <br /><br />
                    या प्रक्रियेदरम्यान कोणतीही अनपेक्षित गुंतागुंत उद्भवल्यास आणि अतिरिक्त उपचार, शस्त्रक्रिया, औषधोपचार किंवा रुग्णालयात दाखल होण्याची आवश्यकता भासल्यास, माझ्या वतीने आवश्यक निर्णय घेण्यास व योग्य ती वैद्यकीय कारवाई करण्यास
                    मी माझ्या डॉक्टरांना अधिकृत करीत आहे. <br /><br />
                    मी कबूल करतो/करते की, वरील माहिती मी वाचली आहे (किंवा मला वाचून दाखविण्यात आली आहे) आणि ती मला पूर्णपणे समजली आहे. मी ही प्रक्रिया स्वेच्छेने करून घेण्यास संमती देत आहे.

                </p>

                <hr style={{
                    width: "100%",
                    border: "0",
                    borderTop: "3px solid black"
                }} />

                <b>प्रक्रियेचे वर्णन :</b>
                <ul className="paragraph">
                    <li>
                        बोन मॅरो ऍस्पिरेशन आणि बायोप्सी ही अस्थिमज्जेची तपासणी करण्यासाठी केली जाणारी प्रक्रिया आहे.
                    </li>

                    <li>
                        ऍस्पिरेशन :अस्थिमज्जेचा एक छोटा नमुना काढण्यासाठी हाडामध्ये (सामान्यतः नितंबाच्या इलियाक क्रेस्ट भागात) विशेष सुई घातली जाते.
                    </li>

                    <li>
                        बायोप्सी :तपासणीसाठी हाड व अस्थिमज्जेचा एक छोटा तुकडा घेतला जातो.
                    </li>

                    <li>
                        प्रक्रियेदरम्यान होणारी अस्वस्थता कमी करण्यासाठी स्थानिक भूल (Local Anesthesia) देऊन संबंधित भाग सुन्न केला जाईल.
                    </li>
                    <li>
                        त्यानंतर घेतलेला नमुना सविस्तर विश्लेषणासाठी प्रयोगशाळेत पाठविला जाईल.
                    </li>
                </ul>

                <hr style={{
                    width: "100%",
                    border: "0",
                    borderTop: "3px solid black"
                }} />

                <p className="paragraph">
                    <b>संभाव्य जोखीम आणि गुंतागुंत :</b><br />
                    अस्थिमज्जा ऍस्पिरेशन आणि बायोप्सी ही प्रक्रिया सामान्यतः सुरक्षित असली तरी, या प्रक्रियेशी संबंधित काही संभाव्य जोखीम आणि गुंतागुंत असू शकतात.
                    त्यामध्ये पुढील बाबींचा समावेश होतो : <br />
                    <ol className="paragraph">
                        <li>
                            बायोप्सीच्या ठिकाणी रक्तस्त्राव होऊ शकतो.
                        </li>

                        <li>
                            निर्जंतुकीकरणाची सर्व काळजी घेतली जात असली तरी बायोप्सीच्या ठिकाणी संसर्ग होण्याची शक्यता असते.
                        </li>

                        <li>
                            सुई घालण्याच्या ठिकाणी प्रक्रियेदरम्यान किंवा प्रक्रियेनंतर वेदना अथवा अस्वस्थता जाणवू शकते.
                        </li>

                        <li>
                            प्रक्रियेदरम्यान वापरण्यात येणाऱ्या स्थानिक भूल औषधामुळे (Local Anesthetic) अॅलर्जिक प्रतिक्रिया येऊ शकते.
                        </li>

                        <li>
                            आजूबाजूच्या ऊती किंवा अवयवांना इजा होण्याची शक्यता असते, जरी ही गुंतागुंत अत्यंत दुर्मिळ आहे.
                        </li>

                        <li>
                            प्रक्रियेच्या ठिकाणी जखम किंवा रक्तसंचय (हेमेटोमा) तयार होऊ शकतो.
                        </li>

                        <li>
                            प्रक्रियेदरम्यान किंवा त्यानंतर मूर्च्छा येणे, चक्कर येणे किंवा डोके हलके वाटणे अशी लक्षणे दिसू शकतात.
                        </li>

                        <li>
                            प्रक्रियेनंतर काही काळ सतत वेदना किंवा अस्वस्थता राहू शकते.
                        </li>
                        हे सर्व धोके योग्य वैद्यकीय तंत्र, निर्जंतुकीकरणाच्या उपाययोजना आणि रुग्णांची काळजीपूर्वक निगा राखून कमीत कमी करण्याचा प्रयत्न केला जाईल;
                        तथापि, अशा गुंतागुंतींची शक्यता पूर्णपणे नाकारता येत नाही.
                    </ol>
                    <hr style={{
                    width: "100%",
                    border: "0",
                    borderTop: "3px solid black"
                }} />

                </p>
                <DeclarationPICCBoneMarrowChemo
                    patientSign="रुग्णाची सही :"
                    parentName="पालक / अधिकृत प्रतिनिधीचे नाव  :"
                    parentSign="पालक / अधिकृत प्रतिनिधीचे सही :"
                    date="दिनांक :"
                    patientRelative="रुग्णाशी नाते :" />
            </div>
        </div>

    )
}

export default BoneMarrowMar;