import React from "react";
import SignaturePad from "../SignaturePad";
import Table_Form from "../Tabel_Form";
import "../Minor_Surgical/MinorEnglish.css";
import DeclarationPICCBoneMarrowChemo from "../Common_Code/DeclarationPICCBoneMarrowChemo";



function IntraMethotrexateMar() {
    return (
        <div className="consent-form">
            <h2 className="title" >
                श्रद्धा हॉस्पिटल, दौंड
            </h2>
            <h4 className="title">
                इंट्राथेकल मेथोट्रेक्सेट प्रक्रियेसाठी संमतीपत्र
            </h4>


            <Table_Form />
            <div>
                <strong>
                    निदान : <span><SignaturePad width={700} height={40} design="border" /></span>
                </strong>
                <br /><br />

                <strong>
                    प्रस्तावित उपचार : <span><SignaturePad width={700} height={40} design="border" /></span>
                </strong>
                <br /><br />
                <p className="paragraph">
                    मी (किंवा रुग्णाचा नातेवाईक), <span><SignaturePad width={300} height={30} design="line" /></span>, इंट्राथेकल मेथोट्रेक्सेट (Inj. Methotrexate 12 mg) ही प्रक्रिया करण्यासाठी
                    डॉ. <span><SignaturePad width={250} height={30} design="line" /></span> आणि त्यांच्या सहाय्यक वैद्यकीय कर्मचाऱ्यांना माझी संमती देत आहे.
                    जर डॉ. <span><SignaturePad width={255} height={30} design="line" /></span> कोणत्याही कारणास्तव ही प्रक्रिया पूर्ण करू शकले नाहीत, तर पात्र पर्यायी डॉक्टर
                    ही प्रक्रिया पूर्ण करतील, यासही माझी संमती आहे.
                    मला या प्रक्रियेचे स्वरूप, उद्देश, संभाव्य फायदे, धोके व गुंतागुंत याबाबत मला समजेल अशा भाषेत सविस्तर माहिती देण्यात आली असून
                    ती मला पूर्णपणे समजली आहे.
                </p>
                <hr style={{
                    width: "100%",
                    border: "0",
                    borderTop: "2px solid black"
                }} />
                <br />

                <p className="paragraph">
                    <strong>समजावून सांगितलेली माहिती :</strong><br />
                    <ol>
                        <li>
                            <strong>प्रक्रियेचे स्वरूप :</strong> लंबर पंचर (Lumbar Puncture) द्वारे मेंदू व मज्जारस द्रवामध्ये (Cerebrospinal Fluid - CSF) मेथोट्रेक्सेट (Methotrexate) औषध दिले जाते.
                        </li>

                        <li>
                            <strong>संभाव्य धोके :</strong> वेदना, डोकेदुखी, मळमळ, उलट्या, संसर्ग, रक्तस्त्राव, न्यूरोलॉजिकल गुंतागुंत तसेच औषधाशी संबंधित दुष्परिणाम होऊ शकतात.
                        </li>

                        <li>
                            <strong>अपेक्षित फायदे :</strong> मध्य मज्जासंस्थेशी संबंधित कर्करोगावर उपचार करणे, रोगाची पुनरावृत्ती टाळणे आणि रोग नियंत्रणात सुधारणा करणे.
                        </li>

                        <li>
                            <strong>सावरण्याचा कालावधी :</strong> प्रक्रियेनंतर होऊ शकणारे संभाव्य दुष्परिणाम तसेच पुनर्प्राप्तीसाठी लागणाऱ्या कालावधीबाबत मला माहिती देण्यात आली आहे.
                        </li>

                        <li>
                            <strong>पर्यायी उपचार आणि धोके :</strong> उपलब्ध पर्यायी उपचारपद्धती, त्यांचे संभाव्य धोके तसेच ही प्रक्रिया न केल्यास होणारे संभाव्य परिणाम याबाबत मला सविस्तर माहिती देण्यात आली आहे.
                        </li>
                    </ol>

                    माझ्या सर्व प्रश्नांची समाधानकारक उत्तरे मला मिळाली आहेत. मला कोणत्याही क्षणी या उपचारास नकार देण्याचा अधिकार आहे. मी डॉ.
                    <span><SignaturePad width={300} height={30} design="line" /></span> यांना ही प्रक्रिया
                    करण्यास स्वेच्छेने संमती देत असून, निदान व उपचारासाठी आवश्यक असलेल्या कोणत्याही अतिरिक्त हस्तक्षेपांना देखील माझी संमती देत आहे.
                    जर या प्रक्रियेदरम्यान कोणतीही अनपेक्षित गुंतागुंत उद्भवली आणि अतिरिक्त उपचार, शस्त्रक्रिया, औषधोपचार किंवा रुग्णालयात दाखल होण्याची आवश्यकता भासली,
                    तर माझ्या डॉक्टरांना आवश्यक ते वैद्यकीय निर्णय घेण्यास मी संमती देत आहे.मी हे संमतीपत्र वाचले आहे (किंवा मला वाचून दाखवण्यात आले आहे) आणि
                    त्यातील सर्व माहिती मला पूर्णपणे समजली आहे. मी कोणत्याही दबावाशिवाय, पूर्णपणे स्वेच्छेने ही प्रक्रिया करून घेण्यास संमती देत आहे.
                </p>

                <hr style={{
                    width: "100%",
                    border: "0",
                    borderTop: "2px solid black"
                }} />
                <br />

                <p className="paragraph">
                    
                    <strong>संभाव्य धोके आणि गुंतागुंती :</strong>
                    <br />

                    <ol>
                        <li>
                            <strong>डोकेदुखी :</strong>
                            मेंदूच्या आवरणामध्ये होणाऱ्या बदलांमुळे डोकेदुखी होऊ शकते. पुरेसे पाणी पिणे (हायड्रेशन) आणि विश्रांती घेतल्यास ती कमी होण्यास मदत होते.
                        </li>

                        <li>
                            <strong>मळमळ आणि उलट्या :</strong>
                            मेथोट्रेक्सेट औषधाच्या परिणामामुळे मळमळ किंवा उलट्या होऊ शकतात. आवश्यक असल्यास औषधोपचार दिले जाऊ शकतात.
                        </li>

                        <li>
                            <strong>चक्कर येणे किंवा थकवा :</strong>
                            काही रुग्णांना प्रक्रियेनंतर अशक्तपणा, चक्कर येणे किंवा थकवा जाणवू शकतो.
                        </li>

                        <li>
                            <strong>ताप किंवा थंडी वाजणे :</strong>
                            सौम्य ताप किंवा थंडी वाजू शकते, जी सहसा २४ तासांच्या आत कमी होते.
                        </li>

                        <li>
                            <strong>संसर्ग (मेंदू-मज्जारसाशी संबंधित) :</strong>
                            दुर्मिळ असले तरी, सुई टोचलेल्या ठिकाणी किंवा सेरेब्रोस्पायनल फ्लुइड (CSF) मध्ये संसर्ग होण्याची शक्यता असते.
                        </li>

                        <li>
                            <strong>इंजेक्शनच्या ठिकाणी रक्तस्त्राव :</strong>
                            इंजेक्शन दिलेल्या ठिकाणी किरकोळ रक्तस्त्राव किंवा सूज येऊ शकते.
                        </li>

                        <li>
                            <strong>झटके (सीझर) :</strong>
                            ही दुर्मिळ गुंतागुंत असली तरी, विशेषतः ज्यांना पूर्वीपासून मज्जासंस्थेशी संबंधित आजार आहेत त्यांच्यामध्ये झटके येण्याची शक्यता असते.
                        </li>

                        <li>
                            <strong>पक्षाघात किंवा मज्जातंतूंचे नुकसान :</strong>
                            ही अत्यंत दुर्मिळ गुंतागुंत आहे. मात्र, सुई चुकीच्या ठिकाणी गेल्यास मज्जातंतूंना इजा होण्याची शक्यता असते.
                        </li>
                    </ol>
                    हे धोके टाळण्यासाठी उपचार काळजीपूर्वक केले जातील तसेच प्रक्रियेदरम्यान आणि त्यानंतर रुग्णाचे नियमित व बारकाईने निरीक्षण केले जाईल.
                </p>
                <hr style={{
                    width: "100%",
                    border: "0",
                    borderTop: "2px solid black"
                }} />
                <br />


                <br />

                <DeclarationPICCBoneMarrowChemo
                    patientSign="रुग्णाची सही :"
                    parentName="पालक / अधिकृत प्रतिनिधीचे नाव  :"
                    parentSign="पालक / अधिकृत प्रतिनिधीचे सही :"
                    date="दिनांक :"
                    patientRelative="रुग्णाशी नाते :" />

            </div>


        </div>


    )
}

export default IntraMethotrexateMar;