import React from "react";
import SignaturePad from "../CommonCode/SignaturePad";
import Table_Form from "../CommonCode/Tabel_Form";
import "../CommonCode/FormBasic.css";
import DeclarationInfo from "./DeclarationInfo";


function AdmissionConsentF1Mar() {
    return (
        <div className="consent-form">
            <h2 className="title" >
                श्रद्धा हॉस्पिटल, दौंड
            </h2>
            <h4 className="title">
                संमती पत्र
            </h4>

            <Table_Form />

            <div>
                <p className="paragraph">
                    <label >दिनांक : <input type="date" /></label><br />
                    मी राहणार <span><SignaturePad width={350} height={30} design="line" /></span> <br />
                    मी स्वतः / माझ्या नातेवाईकास <strong>श्रद्धा हॉस्पिटल अँड ICU</strong> येथील डॉक्टरांकडून उपचार घेण्यास संमती देत आहे. मी येथील डॉक्टर, परिचारिका (नर्सेस) व तंत्रज्ञ (टेक्निशियन) यांना
                    माझ्यावर / माझ्या नातेवाईकावर आवश्यक व योग्य ते उपचार करण्याची परवानगी देत आहे. उपचारासाठी आवश्यक असलेल्या सर्व तपासण्या करण्यासही माझी संमती आहे. <br />

                    मी / माझ्या रुग्णासंबंधीची वैद्यकीय कागदपत्रे आवश्यकतेनुसार संबंधित अधिकृत व्यक्तीस दाखविण्यास परवानगी देत आहे. <br />

                    मला रुग्णालयाच्या नियमांची पूर्ण जाणीव असून, त्या नियमांचे पालन करण्यास मी सहमत आहे. रुग्णासोबत असलेले पैसे, दागिने व इतर मौल्यवान वस्तू माझ्या ताब्यात आहेत व त्याबाबत
                    रुग्णालयाची कोणतीही जबाबदारी राहणार नाही.अनपेक्षित परिस्थितीत किंवा उपचार करणारे डॉक्टर अपरिहार्य कारणामुळे उपस्थित राहू शकले नाहीत, तर त्यांच्या ऐवजी योग्य त्या दुसऱ्या
                    डॉक्टरांकडून उपचार करण्यास रुग्णालय व्यवस्थापनास मी परवानगी देत आहे. <br />

                    रुग्ण दाखल झाल्यानंतर रुग्णालय व्यवस्थापनाने सांगितल्यानुसार आवश्यक अनामत रक्कम तात्काळ भरण्यास मी तयार आहे. <br />

                    रुग्णालयाची फी व इतर शुल्क याबाबत मला माहिती देण्यात आली असून, त्यानुसार सर्व देय रक्कम भरण्याची जबाबदारी मी स्वीकारत आहे.काही अनपेक्षित किंवा मानवी प्रयत्नांच्या पलीकडील घटना
                    रुग्णाच्या उपचारादरम्यान घडू शकतात, याची मला पूर्ण जाणीव करून देण्यात आली आहे. अशा परिस्थितीसाठी मी रुग्णालय, डॉक्टर किंवा इतर वैद्यकीय कर्मचाऱ्यांना जबाबदार धरणार नाही. <br />

                    मी वरील सर्व मजकूर काळजीपूर्वक वाचला आहे (किंवा मला वाचून दाखविण्यात आला आहे). तो मला पूर्णपणे समजला असून, त्यानंतर मी ही संमती स्वेच्छेने देत आहे आणि त्यावर स्वाक्षरी करीत आहे. <br />
                    <br />
                    <DeclarationInfo />
                    <hr style={{
                        width: "100%",
                        border: "0",
                        borderTop: "2px solid black"
                    }} />
                </p>
                <p className="paragraph">
                    <strong className="title" style={{ display: "block" }}>रुग्ण अत्यवस्थ असल्याची माहिती</strong>
                    मला / माझ्या नातेवाईकास याची पूर्ण जाणीव आहे की, माझे नातेवाईक <span><SignaturePad width={300} height={30} design="line" /></span>
                    यांची प्रकृती अत्यवस्थ आहे. याबाबतची संपूर्ण माहिती व परिस्थिती डॉक्टरांनी मला / माझ्या नातेवाईकाला समजेल अशा भाषेत समजावून सांगितली आहे.
                    सदर परिस्थिती लक्षात घेऊन पुढील आवश्यक वैद्यकीय उपचार करण्यासाठी मी डॉक्टरांना माझी संमती व परवानगी देत आहे.
                    <br /><br />
                    <DeclarationInfo />
                    <hr style={{
                        width: "100%",
                        border: "0",
                        borderTop: "2px solid black"
                    }} />
                </p>

                <p className="paragraph">
                    <strong className="title" style={{ display: "block" }}>डॉक्टरांच्या सल्ल्याविरुद्ध रुग्णास नेण्यास संमती</strong>
                    मला / माझ्या नातेवाईकास याची पूर्ण जाणीव आहे की, माझे नातेवाईक <span><SignaturePad width={300} height={30} design="line" /></span>
                    यांना डॉक्टरांच्या सल्ल्याविरुद्ध मी स्वतःच्या जबाबदारीवर रुग्णालयातून घेऊन जात आहे. रुग्णाची सध्याची प्रकृती, आजाराची गंभीरता व संभाव्य धोके याबाबतची संपूर्ण माहिती
                    डॉक्टरांनी मला / माझ्या नातेवाईकाला समजेल अशा भाषेत समजावून सांगितली आहे.तरीदेखील, डॉक्टरांच्या सल्ल्याविरुद्ध मी रुग्णास माझ्या स्वतःच्या जबाबदारीवर रुग्णालयातून
                    घेऊन जात आहे. यामुळे भविष्यात उद्भवणाऱ्या कोणत्याही वैद्यकीय गुंतागुंती, दुष्परिणाम किंवा परिणामांसाठी मी स्वतः जबाबदार राहीन.
                    मी रुग्णालय प्रशासन, संबंधित डॉक्टर व वैद्यकीय कर्मचाऱ्यांना या निर्णयासंदर्भात कोणत्याही प्रकारच्या जबाबदारीतून मुक्त करत आहे.
                    <br /><br />
                    <DeclarationInfo />
                    <hr style={{
                        width: "100%",
                        border: "0",
                        borderTop: "2px solid black"
                    }} />
                    <br /><br />
                    <div style={{ display: "flex", justifyContent: "space-between" }}>
                        <label >डॉक्टरांचे नाव <br /><SignaturePad width={300} height={30} design="line" /></label>
                        <label>डॉक्टरांची स्वाक्षरी  <br /><SignaturePad width={200} height={40} design="border" /> </label>
                        <label >दिनांक व वेळ <br /><input type="datetime-local" /></label>
                    </div>
                </p>


            </div>

        </div>

    )
}

export default AdmissionConsentF1Mar;