import React from "react";
import SignaturePad from "../CommonCode/SignaturePad";
import Table_Form from "../CommonCode/Tabel_Form";
import "../CommonCode/FormBasic.css";
import WitnessTable from "./WitnessTable";



function TubalLingation() {


    return (
        <div className="consent-form">
            <h2 className="title" >
                श्रद्धा हॉस्पिटल, दौंड
            </h2>
            <h4 className="title">
                नलिका-रोधन संमतीपत्र
            </h4>

            <Table_Form />
            <div>
                <p className="paragraph">
                    मी <span><SignaturePad width={300} height={30} design="line" /></span> प्रतिज्ञापूर्वक लेखी संमती देते की, अ, ब, क, ड आणि इ मध्ये दिलेली माहिती खरी आहे.
                    माझी संतती प्रतिबंधक नलिका-रोधन शस्त्रक्रिया करण्यासाठी संमती देत असून, त्या शस्त्रक्रियेची व्यवस्था करण्याची विनंती करीत आहे.
                </p>
                <div>

                    अ.
                    <ol className="paragraph">
                        <li>
                            पतीचे वय : <span><SignaturePad width={100} height={30} design="line" /></span> वर्ष
                        </li>
                        <li>
                            एकूण हयात अपत्ये : <br />
                            मुलगा : <span><SignaturePad width={200} height={30} design="line" /></span>
                            वय <span><SignaturePad width={200} height={30} design="line" /></span> <br />
                            मुलगी : <span><SignaturePad width={200} height={30} design="line" /></span>
                            वय <span><SignaturePad width={200} height={30} design="line" /></span> <br />
                            हॉस्पिटलचे नाव : <b>SHRADDHA HOSPITAL AND ICU</b>
                        </li>
                    </ol>


                    ब.
                    <ol className="paragraph">
                        <li>
                            मी विवाहित आहे. माझे पती हयात आहेत.
                        </li>
                    </ol>

                    क.
                    <ol className="paragraph">
                        <li>
                            मला आता अधिक संतती होऊ देण्याची इच्छा नाही.
                        </li>
                        <li>
                            यापुढे संतती होण्याचे कायमचे बंद व्हावे अशी इच्छा असल्यामुळे मी स्वखुशीने वरील शस्त्रक्रिया करून घेऊ इच्छिते.
                        </li>
                        <li>
                            ही शस्त्रक्रिया कायमस्वरूपी असल्यामुळे शस्त्रक्रियेनंतर उर्वरित आयुष्यात संतती होणार नाही याची मला जाणीव आहे.
                        </li>
                        <li>
                            मी वरील शस्त्रक्रिया करून घेण्याचा निर्णय घेताना माझ्या पतीची संमती घेतली आहे.
                        </li>
                        <li>
                            हा निर्णय मी आणि माझ्या पतीने पूर्ण विचारांती घेतला असून तो कोणत्याही दबावाखाली, प्रलोभनामुळे किंवा कोणाच्याही जबरदस्तीने घेतलेला नाही.
                            यापूर्वी माझी या प्रकारची शस्त्रक्रिया झालेली नाही.
                        </li>
                    </ol>


                    ड.
                    <ol className="paragraph">
                        <li>
                            वरील शस्त्रक्रिया क्वचित प्रसंगी असफल होऊन गर्भधारणा होऊ शकते हे मला माहित आहे. अशी गर्भधारणा झाल्यास मला वैद्यकीय गर्भपात करून घेता येतो याची मला कल्पना आहे.
                        </li>
                        <li>
                            मी या नलिका-रोधन शस्त्रक्रियेसाठी संपूर्ण भूल, स्पायनल किंवा लोकल भूल घेण्यासाठी तयार आहे. वरीलपैकी भुलेचा प्रकार भूलतज्ञ <br /> डॉ.
                            <span><SignaturePad width={400} height={30} design="line" /></span> आणि शस्त्रक्रिया तज्ञ  <br />डॉ.
                            <span><SignaturePad width={300} height={30} design="line" /></span> यांनी समजावून सांगितला आहे. त्याचप्रमाणे माझ्या तब्येतीच्या दृष्टीने
                            योग्य व आवश्यक औषधे वरील डॉक्टर देतील हे मला मान्य आहे.
                        </li>
                        <li>
                            संतती होऊ नये याकरिता वापरात असणाऱ्या अन्य पद्धतीची मला माहिती देण्यात आली आहे.
                        </li>
                        <li>
                            या शस्त्रक्रियेमधील किंवा त्यानंतर उद्भवणाऱ्या संभाव्य धोक्यांची मला जाणीव देण्यात आली आहे. <br />

                            उदा. : <SignaturePad width={700} height={30} design="line" />
                        </li>
                        <li>
                            या शस्त्रक्रियेसाठी पात्र असण्याबाबतचे नियम मला समजावून सांगण्यात आले असून, त्यानुसार मी ही शस्त्रक्रिया करून घेण्यास संपूर्णपणे पात्र आहे.
                        </li>
                        <li>
                            या शस्त्रक्रियेनंतर मासिक पाळी चुकल्यास मी संबंधित रुग्णालयाच्या डॉक्टरांना पंधरा दिवसांच्या आत तपासणी, पुढील मार्गदर्शन व उपचारासंबंधी भेटेन.
                        </li>
                    </ol>


                    इ.
                    <ol className="paragraph">
                        <li>
                            यापूर्वी वरील शस्त्रक्रिया करून घेतली होती, परंतु ती असफल झाल्यामुळे आता माझ्यावर फेर शस्त्रक्रिया करून घेण्यास मी तयार आहे.
                        </li>
                    </ol>

                    फ.
                    <ol className="paragraph">
                        <li>
                            शस्त्रक्रियेनंतर पाठपुरावा सेवा घेण्यासाठी वैद्यकीय सल्ल्यानुसार मी वेळोवेळी रुग्णालयात येईल, अन्यथा होणाऱ्या परिणामांची सर्वस्वी जबाबदारी माझी राहील.
                            घोषणा
                        </li>
                    </ol>

                    <b className="title" style={{ display: "block" }}>
                        <input type="checkbox" /> वरील सर्व मजकूर मी वाचला आहे /  <input type="checkbox" /> मला वाचून दाखविण्यात आला आहे.
                        <br />
                        मला तो समजला आहे व त्यास माझी संपूर्ण मान्यता आहे.


                    </b>
                    <br />
                    <WitnessTable/>



                </div>
            </div>
        </div>
    )
}

export default TubalLingation;