import React from "react";
import SignaturePad from "../CommonCode/SignaturePad";
import Table_Form from "../CommonCode/Tabel_Form";
import "../CommonCode/FormBasic.css";
import PatientDeclaration from "./PatientDeclaration";
import DiagnosticProcedureEng from "./DiagnosticProcedureEng";


function DiagnosticProcedureMar() {
    return (
        <div className="consent-form">
            <h2 className="title" >
                श्रद्धा हॉस्पिटल, दौंड
            </h2>
            <h4 className="title">
                रोगनिदान प्रक्रियेसाठी संमती तसेच माहिती उघड करण्यास व लाभांचे हस्तांतरण करण्यास अधिकृत परवानगी
            </h4>

            <Table_Form />
            <div>

                <p className="paragraph">
                    मी असे नमूद करतो / करते की, खाली सही करण्यापूर्वी मला पुढील माहिती देण्यात आलेली आहे –
                    वैद्यकीय निदानासाठी करण्यात येणाऱ्या तपासण्या काही प्रमाणात धोकादायक व त्रासदायक असू शकतात. मला आवश्यक
                    असणाऱ्या खालील तपासणीविषयी व त्यामध्ये असणाऱ्या धोक्याची पूर्ण कल्पना मला देण्यात आली असून माझ्या डॉक्टरांशी
                    सल्लामसलत करून माझ्या सर्व प्रश्नांची समाधानकारक उत्तरे मला मिळालेली आहेत.
                    <br /><br />मी असे नमूद करतो / करते की,
                    या तपासणीसाठी मी सर्व माहिती समजावून घेऊन ती करण्याची संमती देत आहे.
                    <br /><br />तसेच मी माझ्या वैद्यकीय चाचण्यांच्या
                    नोंदी आवश्यक तेव्हा वापरण्याची अनुमती माझ्यावर उपचार करणाऱ्या डॉक्टरांना व रुग्णालय प्रशासनाला देत आहे.

                </p>

                <strong >
                    रोगनिदान प्रक्रियेचे नाव :-
                </strong>
                <SignaturePad width={700} height={30} design="line" />
                <br />
                <p className="paragraph">
                    मी प्रमाणित करतो / करते की, या संमतीपत्रातील मजकूर तसेच रुग्ण व डॉक्टर यांच्यामधील झालेला संवाद मी अचूकपणे
                    रुग्णाला समजेल अशा भाषेत समजावून सांगितला असून त्याचा योग्य अर्थ रुग्णाला समजला आहे.
                </p>

                <PatientDeclaration
                    Date="दिनांक"
                    Time="वेळ"
                    patientName="रुग्णाचे / नातेवाईकाचे नाव (रुग्णाशी नाते)"
                    sign="सही"
                    doctorName="दुभाष्याचे नाव"
                    consulantDoctor="डॉक्टरांचे नाव"
                />

                <br />
                <p className="paragraph">
                    मी याप्रमाणे माझ्या पुढील वैद्यकीय उपचारासाठी आवश्यकतेनुसार माझे एक्स-रे फिल्म्स, स्कॅन्स तसेच वैद्यकीय नोंदी (Medical Records) 
                    उपलब्ध करून देण्यास अधिकृत परवानगी देत आहे.तसेच, या रोगनिदान प्रक्रियेसाठी माझ्यावर उपचार करणारे डॉक्टर, संदर्भित (Referring) 
                    डॉक्टर तसेच इतर कोणतेही आरोग्यसेवा प्रदाते यांना माझे एक्स-रे फिल्म्स, स्कॅन्स तसेच वैद्यकीय नोंदी आवश्यकतेनुसार वापरण्यास व परस्पर 
                    उपलब्ध करून देण्यास मी अधिकृत परवानगी देत आहे.
                </p>

            </div>
        </div>
    )
}

export default DiagnosticProcedureMar;