import React from "react";
import SignaturePad from "../CommonCode/SignaturePad";
import "../CommonCode/FormBasic.css";

function RulesForm() {
    return (
        <div>
            <p className="paragraph">
                    रुग्णाला दाखल करून घेण्याचा हक्क या रुग्णालयाच्या व्यवस्थापनाने राखून ठेवला आहे.
                <ol>
                    <li>
                        डॉक्टरांनी मला / आम्हांला माझ्या / आमच्या रुग्णाच्या <span><SignaturePad width={300} height={30} design="line"/></span> 
                        आजाराची व त्याच्या प्रकृतीची आताची परिस्थिती संपूर्ण माहिती व कल्पना दिली आहे.
                    </li>

                    <li>
                        मला / आम्हांला डॉक्टरांनी कराव्या लागणाऱ्या तपासण्या, औषधोपचार, त्यांचे परिणाम व संभाव्य दुष्परिणाम किंवा अकस्मात प्रतिक्रिया व संभाव्य विकृती व विकोप इ. सर्व बाबींची संपूर्ण व स्पष्ट कल्पना दिली आहे.
                    </li>

                    <li>
                        गरज भासल्यास रुग्णाच्या बाबतीत आवश्यकतेप्रमाणे अतिरिक्त विशेष तज्ज्ञांचा सल्ला घेण्यास माझी संमती आहे. त्या संबंधीच्या खर्चाची जबाबदारी माझ्यावर / आमच्यावर राहील.
                    </li>

                    <li>
                        गरज भासल्यास अ.द.िव. (अतिदक्षता विभाग) मध्ये हलविण्यास माझी / आमची संमती आहे. अशा निर्णयाचे परिणाम व त्यासाठी कराव्या लागणाऱ्या खर्चाची जबाबदारी मी / आम्ही स्वीकारू.
                    </li>

                    <li>
                        आवश्यकतेनुसार कराव्या लागणाऱ्या तपासण्या व औषधोपचार यांना माझी / आमची संमती आहे. तसेच या तपासण्या / औषधोपचारांमुळे काही दुष्परिणाम होण्याची शक्यता असल्यास त्याबाबत मी / आम्ही संबंधित डॉक्टरांकडून वेळोवेळी माहिती जाणून घेऊ.
                    </li>

                    <li>
                        रुग्णालयात वापरण्यात येणारी औषधे, सलाईनच्या बाटल्या, सलाईन सेट इत्यादी वस्तू प्रमाणित कंपनींच्या असतात याची मला जाणीव आहे.
                    </li>

                    <li>
                        रुग्णाच्या प्रकृतीविषयी वेळोवेळी मी डॉक्टरांकडून माहिती करून घेईन.
                    </li>

                    <li>
                        रुग्ण अथवा रुग्णाच्या नातेवाईकांकडून रुग्णालयातील वस्तूची मोडतोड झाल्यास त्याची सर्व जबाबदारी माझ्यावर / आमच्यावर राहील व त्याचा आकार मी / आम्ही भरण्यास तयार आहोत.
                    </li>

                    <li>
                        या हॉस्पिटलमध्ये असलेल्या सुविधा मला / आम्हांला माहित आहेत. काही प्रकारच्या सुविधा नसल्याची कल्पना मला / आम्हांला डॉक्टरांनी दिलेली आहे.
                    </li>

                    <li>
                        वैद्यकीय ज्ञानाच्या वृद्धीसाठी उपचार करतांना घेतलेली छायाचित्रे (Photographs / Transparencies) (Audio Visual Tapes) प्रदर्शित अथवा प्रकाशित करण्यास माझी / आमची अनुमती आहे. मी / आम्ही असे गृहीत धरतो की अशा प्रदर्शनात अथवा प्रकाशनात माझी / रुग्णाची ओळख दिली जाणार नाही.
                    </li>

                    <li>
                        रुग्णाच्या छाती / पाठीतील पाणी कोणत्याही भल्यासाठी काढून घेण्यास तयार आहे.
                    </li>
                </ol>
                वरील सर्व कलमे मी / आम्ही वाचली आहेत. ती मला / आम्हांला समजली आहेत व मला मान्य आहेत व ती माझ्यावर / आमच्यावर बंधनकारक आहेत.
                तरी मी / आम्ही रुग्णालयाच्या अधिकाऱ्यांना मला / रुग्णाचे नाव <span><SignaturePad width={300} height={30} design="line"/></span> 
                या रुग्णालयात दाखल करून घेण्याची विनंती करतो.
                उपरोक्त अनुमति पत्र की शर्तें मुझे मेरी मातृभाषा में पढ़कर समझाई गई हैं। वे मुझे स्वीकार हैं और मेरे ऊपर बाध्यकारी हैं।
                <br />Above Points Have Been Explained to me in detail in my own language and I agree with them.
            </p>
        </div>
    )
}

export default RulesForm;