import React from "react";
import SignaturePad from "../CommonCode/SignaturePad";
import Table_Form from "../CommonCode/Tabel_Form";
import "../CommonCode/FormBasic.css";
import PatientDeclaration from "./PatientDeclaration";


function PCNLMar() {


    return (
        <div className="consent-form">
            <h2 className="title" >
                श्रद्धा हॉस्पिटल, दौंड
            </h2>
            <h4 className="title">
                PCNL सुचना व संमतीपत्र
            </h4>

            <Table_Form />
            <div>
                <p className="paragraph">
                    <ul className="paragraph">

                        <li>
                            <strong>PCNL म्हणजे काय?</strong><br />
                            मूत्रपिंडातील काही खडे जे लिथोट्रिप्सीद्वारे फोडणे अवघड असते (उदा. २ ते २.५ सेमी पेक्षा मोठे खडे किंवा फार कठीण खडे जे लिथोट्रिप्सीद्वारे फुटत नाहीत किंवा काही खडे अशा ठिकाणी असतात ज्यांचा लिथोट्रिप्सीने बारीक चुरा बाहेर पडणे अवघड असते), असे खडे PCNL पद्धतीने काढावे लागतात. या पद्धतीत रुग्णाला पूर्ण भूल द्यावी लागते व पाठीत छोटेसे छिद्र करून मूत्रपिंडापर्यंत एक वायर घातली जाते. त्या मार्गाने मुतखडे काढले जातात.
                        </li>

                        <li>
                            <strong>PCNL चे फायदे :</strong>
                            <ol className="paragraph">
                                <li>
                                    वेदना कमी असतात.
                                </li>
                                <li>
                                    रुग्णाला लवकर घरी जाता येते.
                                </li>
                                <li>
                                    रुग्णाच्या पोटावर मोठा व्रण येत नाही.
                                </li>
                                <li>
                                    ऑपरेशननंतर लवकर काम सुरू करता येते.
                                </li>
                            </ol>
                        </li>

                        <li>
                            <strong>काही महत्त्वाच्या गोष्टी :</strong>
                            <ol className="paragraph">
                                <li>
                                    हे ऑपरेशन पूर्ण अथवा कमरेखाली भूल देऊन केले जाते.</li>
                                <li>
                                    ऑपरेशनपूर्वी रक्ताची व्यवस्था करावी लागते.
                                </li>

                                <li>
                                    ऑपरेशननंतर पाठीत एक नळी २ ते ३ दिवस ठेवावी लागते.
                                </li>

                                <li>
                                    एक नळी (D-J Stent) मूत्रपिंडापासून मूत्राशयापर्यंत ठेवली जाते. ती नंतर डॉक्टरांच्या सल्ल्यानुसार काढावी लागते.
                                </li>

                                <li>
                                    मोठ्या खड्यांमध्ये सहसा जंतुप्रादुर्भाव असतो. म्हणून PCNL पूर्वी व नंतर प्रतिजैविके (Antibiotic) दिली जातात. तरीही जंतुसंसर्ग (इन्फेक्शन) होण्याची थोडीफार शक्यता असते.
                                </li>

                                <li>
                                    ऑपरेशननंतर कधी कधी रक्त देण्याची आवश्यकता असते. जवळपास १ ते २ टक्के रुग्णांमध्ये अपेक्षेपेक्षा जास्त रक्तस्राव होण्याची शक्यता असते.
                                </li>

                                <li>
                                    क्वचित म्हणजे हजारात एखाद्या रुग्णाला अतिरक्तस्रावासाठी अँजिओग्राफी (Angioembolisation) करून रक्तस्राव बंद करण्याची गरज पडू शकते.
                                </li>

                                <li>
                                    जवळपास ५% रुग्णांमध्ये मूत्रपिंडातून पू येऊ शकतो. अशा वेळी एक नळी ठेवून २ ते ३ दिवसांनी पू पूर्णपणे थांबल्यावर ऑपरेशन करावे लागते.
                                </li>

                                <li>
                                    क्वचित मुतखड्याची व मूत्रपिंडाची अशी रचना असते की, पूर्णपणे खडे काढणे शक्य नसते. राहिलेल्या खड्यांना लिथोट्रिप्सी करावी लागते. एवढे करूनही क्वचित एखादा खडा पूर्णपणे निघत नाही.
                                </li>

                                <li>
                                    कधी कधी मूत्रपिंडापर्यंत पोहोचण्यासाठी बरगड्यांमधून मार्ग करावा लागतो. अशा वेळी कधी कधी छातीत पाणी भरण्याची शक्यता असते. अशा वेळी एका छोट्या नळीद्वारे पाणी काढले जाते व पूर्ण पाणी निघाल्यावर नळी काढली जाते.
                                </li>

                                <li>
                                    PCNL द्वारे मुतखडा काढला गेला तरी परत मुतखडा होणारच नाही अशी खात्री देता येत नाही. मुतखडा पुन्हा होऊ नये म्हणून डॉक्टरांच्या सल्ल्याचे पालन करावे.
                                </li>
                            </ol>
                        </li>

                            मी वरील सूचना वाचल्या असून किंवा त्या मला समजावून सांगण्यात आल्या असून त्या मला नीट समजल्या आहेत. PCNL ऑपरेशन करण्यासाठी माझी डॉक्टरांना पूर्ण संमती आहे.
                    </ul>
                </p>
                <br />
                <PatientDeclaration/>

            </div>
        </div>
    )
}

export default  PCNLMar;