import React from "react";
import SignaturePad from "../CommonCode/SignaturePad";
import Table_Form from "../CommonCode/Tabel_Form";
import "../CommonCode/FormBasic.css";
import PatientDeclaration from "./PatientDeclaration";
import InterpertorDeclaration from "./InterpertorDeclaration";



function GarbhapishviMar() {


    return (
        <div className="consent-form">
            <h2 className="title" >
                श्रद्धा हॉस्पिटल, दौंड
            </h2>
            <h4 className="title">
                गर्भाशयाच्या शस्त्रक्रियेमधील विशेष धोके स्वीकारण्याबाबतचे संमतीपत्र
            </h4>

            <Table_Form />
            <div>

                <p className="paragraph">
                    आम्ही आमच्या रुग्णास गर्भाशयाच्या ऑपरेशनकरिता वरील हॉस्पिटलमध्ये भरती केले आहे. सर्वसाधारणपणे गर्भाशयाचे ऑपरेशन सुरक्षित मानले जात असले तरीही काही वेळा खालील धोके उद्भवू शकतात.
                    ते धोके डॉक्टरांनी आम्हांस समजावून सांगितलेले आहेत.गर्भाशय अथवा अंडाशयाची गाठ असल्यास / आधी पोटाचे काही ऑपरेशन झालेले असल्यास / सिझेरियनचे ऑपरेशन झालेले असल्यास /
                    पेशंटचे वजन ५० किलोपेक्षा जास्त असल्यास / पेशंटच्या पोटाच्या भागावर जास्त चरबी (मोटापा) असल्यास / गर्भाशय अथवा लघवीची पिशवी खाली सरकलेली असल्यास, खालील धोके होण्याची
                    शक्यता इतर पेशंटपेक्षा अधिक असते.तरी अशा रुग्णांनी खालील गोष्टींची विशेष दखल घेऊनच सही करावी. वरील जोखीम (Risk Factors) नसलेल्या रुग्णांमध्ये देखील खालील धोके होऊ शकतात.
                    <ol className="paragraph">
                        <li>
                            लघवीची पिशवी / लघवीची नलिका यांना इजा होऊन लघवी गळणे (फिस्टुला होणे) याचा धोका असू शकतो. प्रसंगी या अथवा मोठ्या दवाखान्यात पुन्हा ऑपरेशन करावे लागू शकते.
                        </li>

                        <li>
                            ऑपरेशनवेळी अतिरिक्त रक्तस्राव होणे व प्रसंगी जीवास धोका होणे.
                        </li>

                        <li>
                            ऑपरेशनच्या जागेचे टाके विरून भविष्यात हर्निया होणे.
                        </li>

                        <li>
                            अतिरिक्त रक्तस्रावामुळे रक्तदाब कमी होणे, मोठ्या दवाखान्यात हलवावे लागणे तसेच प्रसंगी रुग्णाचा ऑपरेशन टेबलवर मृत्यू होणे.
                        </li>

                        <li>
                            गर्भाशय / गाठ इतर अवयवाला चिकटलेली असल्यास ऑपरेशन न करता पोट बंद करून पुढील उपचार / ऑपरेशनसाठी मोठ्या दवाखान्यात हलवावे लागू शकते.
                        </li>

                        <li>
                            मोठ्या अथवा छोट्या आतड्याला इजा होऊन संडास गळणे (फिस्टुला होणे) याचा धोका असू शकतो. प्रसंगी या अथवा मोठ्या दवाखान्यात पुन्हा ऑपरेशन करावे लागू शकते.
                        </li>

                        <li>
                            गर्भाशयाच्या तोंडाचा भाग (व्हॉल्ट) खाली येऊन भविष्यात अंग बाहेर येण्याचा त्रास पुन्हा अथवा नव्याने होऊ शकतो.
                        </li>

                        <li>
                            आम्हाला डॉक्टरांनी इतर / मोठ्या (सुपर स्पेशालिस्ट / इन्स्टिट्यूट) दवाखान्यात जाऊन ऑपरेशन करण्याचा पर्याय खुला असल्याची कल्पना दिली आहे. परंतु आम्हांस सदर दवाखान्यातील सुविधा व डॉक्टरांचे कौशल्य पुरेसे सुरक्षित असल्याची खात्री झालेली आहे. त्यामुळे आम्ही सदर दवाखान्यात, आम्हाला उपचाराच्या निकालाची (Result) कोणतीही हमी दिलेली नसतानाही, स्वतःहून भरती होत आहोत.
                        </li>
                    </ol>
                </p>

                <p className="paragraph">
                    अशाप्रकारच्या घटना घडल्यास मोठ्या दवाखान्यात जाऊन उपचार करावा लागतो अथवा रुग्णाच्या जीवास धोका निर्माण होऊ शकतो, तसेच बराच खर्च येऊ शकतो याची सर्व कल्पना 
                    आम्हाला डॉक्टरांनी दिली आहे. अशा घटना घडल्यास अथवा ऑपरेशनमध्ये काही दुर्घटना घडल्यास, सर्व धोके आम्हांस मान्य आहेत. त्यासाठी लागणारा सर्व खर्च करण्यास आम्ही तयार आहोत. 
                    तसेच त्याबद्दल आम्ही कोणत्याही संस्था, कोर्ट, पोलीस, पत्रकार अशा ठिकाणी तक्रार करणार नाही. तसेच अशा घटनांसाठी डॉक्टर / दवाखाना आम्हांस कोणतीही नुकसानभरपाई देणार नाही हे आम्हांस मान्य आहे.
                    वरील बाबतीत आमच्या इतर नातेवाईकांना कल्पना देण्याची / समजावून सांगण्याची जबाबदारी आमची आहे.
                    मला मराठी समजते आणि मी वरील मजकूर संपूर्ण समजून घेऊन, माझ्या सर्व शंकांचे निरसन झाल्यावर, कोणतीही घाई, भीती किंवा दबाव यामध्ये न येता स्वखुशीने सही करीत आहे.
                    <br />
                    मुझे हिंदी समझ में आती है। ऊपर दिए गए सभी बिंदु मुझे डॉ. <span><SignaturePad width={300} height={30} design="line"/></span> द्वारा हिंदी में समझाए गए हैं और मुझे पूर्णतः मंजूर हैं। मैं किसी 
                    भी प्रकार के दबाव, डर अथवा जल्दबाज़ी में नहीं हूँ तथा अपनी स्वयं की इच्छा से इस सहमति पत्र पर हस्ताक्षर कर रहा / रही हूँ।
                    <br />
                     I understand english. I have been explained all the above points in english by <br />Dr <span><SignaturePad width={300} height={30} design="line"/></span>, 
                     I am ready to accept all condition given in them. I hereby signing below without any fear / pressure on in hurry .
                </p>
                <PatientDeclaration/>
                <br />
                <p className="paragraph">
                    <b className="title" style={{display:"block"}}>
                        Interpretor Undertaking
                    </b>
                    मी आणि डॉक्टरांनी रुग्ण व नातेवाईकास वरील सर्व धोके <span><SignaturePad width={200} height={30} design="line"/></span> भाषेत समजावून सांगितले. त्यांच्या सर्व शंकांचे 
                    निरसन केले असून त्यांनी वरील सर्व बाबींना स्वखुशीने मान्यता दिली आहे.
                </p>
                <br />
                <InterpertorDeclaration/>



            </div>
        </div>
    )
}

export default GarbhapishviMar;