import React from "react";
import SignaturePad from "../SignaturePad";
import Table_Form from "../Tabel_Form";
import "../Minor_Surgical/MinorEnglish.css"
import DeclarationFooterCovidMar from "./DeclarationFooterCovidMar";

function Covid19Mar() {
    return (
        <div className="consent-form">
            <h2 className="title" >
                श्रद्धा हॉस्पिटल, दौंड
            </h2>
            <h4 className="title">
                कोविड-१९ संमतीपत्र
            </h4>
            <Table_Form />
            <b style={{ display: "block", textAlign: "center" }}>
                कोविड-१९ महामारी अंतर्गत तातडीची व सर्वसाधारण शस्त्रक्रिया प्रक्रिया संमतीपत्र
            </b>
            <br />
            
            <p className="paragraph">
                मी,<span><SignaturePad width={300} height={40} design="line" /></span> वय <span style={{ marginTop: "10px" }}><SignaturePad width={50} height={30} design="line" /></span>वर्षे, राहणार
                <span ><SignaturePad width={150} height={30} design="line" /></span><span ><SignaturePad width={350} height={30} design="line" /></span> मोबाईल क्रमांक,
                <span><SignaturePad width={200} height={30} design="line" /></span>,असे शपथपूर्वक मान्य करतो/करते की, मला माझ्या मातृभाषेमध्ये
                कोविड-१९ या रोगाच्या साथीबद्दल संपूर्ण माहिती देण्यात आली आहे.
                <br /><br />कोविड-१९ या साथीच्या आजारासंबंधित सर्व धोके, प्रतिबंधात्मक उपाययोजना तसेच त्यावरील उपचार यांची
                माहिती जाणून घेतल्यानंतर, माझ्यावर करण्यात येणाऱ्या शस्त्रक्रियेची आवश्यकता तसेच तिचे अपेक्षित व संभाव्य विपरीत परिणाम यांची माहिती घेऊन मी ही
                शस्त्रक्रिया करण्यास संमती देत आहे. <br /><br /> सदर शस्त्रक्रिया करत असताना माझे संपूर्ण हित लक्षात घेऊन त्यामध्ये आवश्यक ते बदल करण्यास मी डॉक्टरांना परवानगी देत आहे. <br /><br />
                मी स्पष्टपणे जाहीर करतो/करते की, कोविड-१९ या साथीच्या आजाराबाबत खालीलप्रमाणे कोणतीही लक्षणे माझ्यामध्ये आढळलेली नाहीत :
                <ol>
                    <li>
                        कोरडा खोकला
                    </li>
                    <li>
                        ताप
                    </li>
                    <li>
                        धाप लागणे
                    </li>
                    <li>
                        थंड / वाहणारे नाक
                    </li>
                    <li>
                        घसा खवखवणे
                    </li>
                    <li>
                        वास / चव कमी होणे
                    </li>
                </ol>
            </p>

            <p className="paragraph">
                याबरोबरच मी जाहीर करतो की, <br />
                मी गेल्या १४ दिवसांत कोविड-१९ प्रभावित देशांमध्ये किंवा भारतातील कोविड-१९ प्रभावित क्षेत्रांमध्ये बस, रेल्वे, विमान किंवा इतर
                कोणत्याही खाजगी अथवा व्यावसायिक वाहनाद्वारे प्रवास केलेला नाही.
                <br /><br />
                SHRADDHA HOSPITAL AND ICU मधील डॉक्टर किंवा इतर कर्मचारी यांना वर नमूद केलेली कोणतीही लक्षणे नसतानाही त्यांना कोरोना विषाणूची
                लागण झालेली असू शकते आणि त्यांच्याकडून मलाही संसर्ग होण्याची शक्यता असू शकते.अशा प्रकारचा संसर्ग झाल्यास त्यासाठी मी SHRADDHA
                HOSPITAL AND ICU मधील डॉक्टर, कर्मचारीवर्ग किंवा रुग्णालय प्रशासन यांना जबाबदार धरणार नाही.
            </p>

            <p className="paragraph">
                मला कोविड-१९ या साथीच्या आजाराबद्दल खालील माहिती सविस्तरपणे समजावून सांगण्यात आली आहे : <br /><br />
                <ol >
                    <li>
                        कोविड-१९ या आजाराचा उद्भवन कालावधी (Incubation Period) साधारणपणे ३ ते १४ दिवसांचा असतो. या कालावधीत कोणतीही 
                        लक्षणे दिसून येत नसली तरी संबंधित व्यक्तीकडून इतरांना संसर्ग होऊ शकतो.
                    </li>

                    <li>
                        कोविड-१९ चाचणीचा अहवाल निगेटिव्ह आल्यास संसर्ग झालेला नाही, असे निश्चितपणे म्हणता येत नाही. अशा परिस्थितीत एका 
                        आठवड्यानंतर पुन्हा तपासणी करण्यास माझी संमती आहे. अपवादात्मक परिस्थितीत तपासणी निगेटिव्ह असतानाही छातीचा CT 
                        Scan (HRCT Chest) किंवा PCR चाचणी करण्याची आवश्यकता भासू शकते. डॉक्टरांना उपचारादरम्यान आवश्यक वाटल्यास 
                        कोविड-१९ संदर्भातील सर्व आवश्यक तपासण्या करण्यास माझी पूर्ण संमती व सहकार्य राहील.
                    </li>

                    <li>
                        आज माझी कोविड-१९ चाचणी निगेटिव्ह असली तरी रुग्णालयात दाखल झाल्यानंतर माझी कोविड-१९ चाचणी पॉझिटिव्ह येऊ शकते. 
                        या संसर्गाचा संबंध रुग्णालयाशी असू शकतो किंवा नसू शकतो.
                    </li>

                    <li>
                        मला भारत सरकारच्या आरोग्य व कुटुंब कल्याण मंत्रालयाने प्रकाशित केलेल्या नवीन राष्ट्रीय मार्गदर्शक तत्त्वांची माहिती देण्यात आली आहे. 
                        त्यानुसार तातडीच्या व जीवनरक्षक शस्त्रक्रियांना प्राधान्य देण्यात आले असून, सर्वसाधारण शस्त्रक्रिया कोविड-१९ परिस्थिती सामान्य होईपर्यंत 
                        पुढे ढकलण्याचा सल्ला देण्यात आलेला आहे.
                    </li>

                    <li>
                        माझ्यावर करण्यात येणारी तातडीची शस्त्रक्रिया माझा जीव वाचविण्यासाठी अत्यंत आवश्यक आहे, याची मला पूर्ण जाणीव आहे.
                    </li>

                    <li>
                        उपचारादरम्यान मला कोविड-१९ संसर्ग झाल्यास किंवा त्यासंबंधित कोणतीही गंभीर गुंतागुंत निर्माण झाल्यास, मी डॉक्टर, नर्स, वॉर्ड बॉय, 
                        आया, पॅरामेडिकल कर्मचारी, सोनोग्राफी कर्मचारी, रिसेप्शनिस्ट, कार्यालयीन कर्मचारी किंवा रुग्णालय प्रशासन यांना जबाबदार धरणार नाही.
                    </li>

                    <li>
                        कोविड-१९ प्रतिबंधासाठी आवश्यक असलेल्या सर्व उपाययोजनांचे पालन करण्यास मी व माझे नातेवाईक सहमत आहोत. त्यामध्ये पुढील बाबींचा समावेश आहे: <br/> उदा :
                        <ol>
                            
                            <li>दोन व्यक्तींमध्ये किमान ४ फूट अंतर राखणे.</li>
                            <li>तोंडावर मास्क वापरणे बंधनकारक आहे.</li>
                            <li>वेळोवेळी साबणाने हात धुणे.</li>
                            <li>नाक, तोंड व डोळ्यांना वारंवार स्पर्श न करणे.</li>
                            <li>रुग्णालयात रुग्णासोबत अनावश्यक गर्दी न करता फक्त एकाच नातेवाईकाने थांबणे.</li>
                        </ol>
                    </li>
                </ol>

            </p>

            <p className="paragraph">
                कोविड-१९ प्रतिबंधात्मक उपाययोजनांचा एक भाग म्हणून शस्त्रक्रियेदरम्यान आवश्यक असणारे वैयक्तिक संरक्षक कवच 
                (PPE - Personal Protective Equipment) वापरणे आवश्यक आहे. रुग्णालयाच्या नियमांनुसार त्यासाठी लागणारा 
                आवश्यक खर्च करण्यास मी सहमत आहे. <br /><br />
                मी पुन्हा शपथपूर्वक जाहीर करतो/करते की, वरील दिलेली सर्व माहिती माझ्या माहितीनुसार खरी व अचूक आहे.
                वरील सर्व बाबी मला सविस्तरपणे समजावून सांगण्यात आल्या आहेत. मी त्या काळजीपूर्वक वाचल्या असून त्या मला पूर्णपणे समजल्या आहेत. <br /><br />
                वरील सर्व बाबींचा सर्वंकष विचार करून, माझ्या आरोग्याच्या हितासाठी माझ्यावर करण्यात येणाऱ्या शस्त्रक्रिया व उपचारांसाठी मी स्वखुशीने संमती देत आहे.
            </p>



            <p className="paragraph">

            </p>


            <DeclarationFooterCovidMar/>

        </div>

    );
}

export default Covid19Mar;
