import React from "react";
import Table_Form from "../Tabel_Form";
import SignaturePad from "../SignaturePad";
import "../Minor_Surgical/MinorEnglish.css";
import DeclarationColonscopyGastroscopy from "../Common_Code/DeclarationColonscopyGastroscopy";



function GastroscopyMar() {
    return (
        <div className="consent-form">
            <h2 className="title" >
                श्रद्धा हॉस्पिटल, दौंड
            </h2>
            <h4 className="title">
                जठराची तपासणी (GASTROSCOPY) करण्याकरीता संमतीपत्र
            </h4>

            <Table_Form />
            <div>
                
                <p className="paragraph">
                <b>जठराची एंडोस्कोपी (Gastroscopy) : </b>यामध्ये अन्ननलिका, जठर (पोट) आणि लहान आतड्याचा पहिला भाग (ड्युओडेनम) यांची तपासणी केली जाते. 
                गॅस्ट्रोस्कोपी ही एक सुरक्षित प्रक्रिया आहे, परंतु इतर कोणत्याही वैद्यकीय प्रक्रियेप्रमाणे यामध्ये काही गुंतागुंत होण्याची शक्यता असते. 
                गॅस्ट्रोस्कोपीनंतर पुढील गुंतागुंत होऊ शकतात : <br />
                </p>

                <ul className="paragraph">
                    <li>अंतर्गत रक्तस्त्राव होणे.</li>
                    <li>अन्ननलिका, जठर किंवा लहान आतड्याच्या पहिल्या भागाला (ड्युओडेनम) भोक पडणे.</li>
                </ul>

                <ol className="paragraph">

                    <li>रुग्णाची सध्याची वैद्यकीय स्थिती, पूर्वानुमान व वैद्यकीय सल्ल्यानुसार होणाऱ्या विविध निदानांबाबत आम्हास समजावून सांगितले आहे.</li>

                    <li>तपासणीदरम्यान व त्यानंतर दुसऱ्या / अन्य रोगाचे निदान होऊ शकते. तसेच तपासणीदरम्यान तो आजार शस्त्रक्रियेने बरा न होणारा किंवा प्रगत स्थितीचा आजार असल्याचे समजू शकते.</li>

                    <li>भविष्यात हा आजार पुन्हा उद्भवण्याची किंवा मूळ स्थानातून शरीराच्या दुसऱ्या भागात / अवयवात पसरण्याची काही प्रमाणात शक्यता असते.</li>

                    <li>वरील नमूद केलेल्या प्रक्रियेसंबंधित धोके व उपद्रव उद्भवल्यास (जे पूर्वीपासून असलेल्या आजारांमुळे अधिक तीव्र होऊ शकतात किंवा वाढू शकतात), औषधे देण्यासाठी मोठ्या रक्तवाहिनीद्वारे उपचार करावे लागू शकतात, अतिदक्षता विभागात (ICU) दीर्घकाळ ठेवावे लागू शकते किंवा कृत्रिम श्वसन उपचाराची आवश्यकता भासू शकते.</li>

                    <li>हे उपचार चालू असताना अचानक माझ्या / माझ्या रुग्णाच्या जीवाला धोका निर्माण झाल्यास, रुग्णाचा जीव वाचविण्यासाठी सर्वतोपरी प्रयत्न केले जातील.</li>

                    <li>वैद्यकीय व सहाय्यक वैद्यकीय कर्मचारी रुग्णाच्या हितासाठी त्यांचे ज्ञान, कौशल्य व अनुभव यांचा योग्य व कार्यक्षम वापर करतील.</li>

                    <li>वरील मजकूर मला समजेल अशा भाषेत समजावून सांगितला असून तो मला पूर्णपणे समजला आहे.</li>

                    <li>वरील नमूद प्रक्रियेदरम्यान किंवा त्यानंतर होणाऱ्या संभाव्य दुष्परिणामांसाठी मी रुग्णालय, वैद्य किंवा सहाय्यक वैद्यकीय कर्मचाऱ्यांना जबाबदार धरणार नाही.</li>

                    <li>सदर संमतीपत्रावर मी पूर्णतः स्वेच्छेने व कोणाच्याही दबावाखाली न येता स्वाक्षरी करीत आहे.</li>

                    <li>मी सदर संमतीपत्राद्वारे <span><SignaturePad width={300} height={30} design="line"/></span> व त्यांच्या इतर सहाय्यक डॉक्टरांना वरील नमूद प्रक्रियेसाठी संमती देत आहे.</li>

                    <li>गरज भासल्यास बायोप्सी (तपासणीसाठी ऊतींचा तुकडा घेणे) करण्यासाठीही माझी संमती आहे.</li>
                </ol>

                <DeclarationColonscopyGastroscopy/>

            </div>
        </div>
    )
}

export default GastroscopyMar;













