import React from "react";
import SignaturePad from "../SignaturePad";
import "../Minor_Surgical/MinorEnglish.css";

function PatientSurgeryDeclaration() {
    return (
        <div>
            <b>रुग्ण / रुग्णाचे नातेवाईक यांचे संमतीपत्र</b> <br />
            डॉक्टरांनी मला समजावून सांगितलेल्या खालील बाबी मला समजल्या असून त्या मला मान्य आहेत.
            <ul className="paragraph">
                <li>
                    माझी / माझ्या रुग्णाची सध्याची वैद्यकीय स्थिती, रोगाचे स्वरूप, रोगाचे संभाव्य परिणाम व त्यावरील उपचार, तसेच प्रकृतीसंबंधित धोके यांची मला माहिती देण्यात आली आहे.
                </li>

                <li>
                    ही शस्त्रक्रिया साधारण, स्थानिक किंवा प्रादेशिक भूल देऊन स्वतंत्रपणे अथवा संयुक्तपणे केली जाऊ शकते. भुलीसाठी स्वतंत्र संमतीपत्र घेण्यात आले आहे.
                </li>

                <li>
                    सुचविलेल्या शस्त्रक्रियेचे स्वरूप, उद्देश, आवश्यकता, संभाव्य परिणाम, फायदे, जोखीम, उपलब्ध पर्यायी उपचार पद्धती तसेच शस्त्रक्रिया न केल्यास उद्भवू शकणारे धोके यांची माहिती मला देण्यात आली आहे.
                </li>

                <li>
                    आवश्यक असल्यास उद्भवलेल्या गुंतागुंतींचे निराकरण करण्यासाठी पुन्हा शस्त्रक्रिया करावी लागू शकते, याची मला कल्पना देण्यात आली आहे.
                </li>

                <li>
                    शस्त्रक्रियेदरम्यान अनपेक्षित परिस्थिती निर्माण झाल्यास, रुग्णाचा जीव वाचविण्यासाठी किंवा योग्य उपचारासाठी मूळ नियोजित शस्त्रक्रियेव्यतिरिक्त इतर शस्त्रक्रिया किंवा उपचार करावे लागू शकतात अथवा शस्त्रक्रिया अर्धवट थांबवावी लागू शकते.
                </li>

                <li>
                    रुग्णाची सध्याची वैद्यकीय स्थिती, तपासण्यांचे निष्कर्ष व वैद्यकीय सल्ल्यानुसार संभाव्य निदानाबाबत मला समजावून सांगण्यात आले आहे.
                </li>

                <li>
                    शस्त्रक्रियेदरम्यान किंवा त्यानंतर इतर कोणत्याही रोगाचे निदान होऊ शकते. तसेच काही आजार शस्त्रक्रियेद्वारे पूर्णपणे बरे होऊ शकत नाहीत किंवा प्रगत अवस्थेत असल्याचे आढळू शकते.
                </li>

                <li>
                    भविष्यात हा रोग पुन्हा उद्भवण्याची किंवा शरीराच्या इतर भागात पसरण्याची शक्यता असू शकते.
                </li>

                <li>
                    शस्त्रक्रियेशी संबंधित धोके किंवा गुंतागुंत उद्भवल्यास, आवश्यकतेनुसार मोठ्या रक्तवाहिनीद्वारे औषधे देणे, अतिदक्षता विभागात (ICU) उपचार करणे किंवा कृत्रिम श्वसनयंत्राची आवश्यकता भासू शकते.
                </li>

                <li>
                    उपचार सुरू असताना अचानक जीवाला धोका निर्माण झाल्यास, रुग्णाचा जीव वाचविण्यासाठी सर्व आवश्यक प्रयत्न केले जातील.
                </li>

                <li>
                    वैद्यकीय व सहाय्यक वैद्यकीय कर्मचारी रुग्णाच्या हितासाठी त्यांचे ज्ञान, कौशल्य व अनुभव यांचा योग्य वापर करतील.
                </li>

                <li>
                    शस्त्रक्रियेदरम्यान काढलेले ऊतक, अवयव किंवा इतर नमुने पुढील तपासणी, निदान व उपचारासाठी वापरले जाऊ शकतात. त्यांचे योग्य प्रकारे जतन, परतावा किंवा विल्हेवाट लावली जाईल.
                </li>

            </ul>

            <br /><br />

            <b>मी नमूद करतो की,</b>  <br />
            <ul className="paragraph">
                <li>
                    सदर संमतीपत्र वाचण्यासाठी व समजून घेण्यासाठी मला पुरेसा वेळ देण्यात आला आहे.
                </li>

                <li>
                    माझी / माझ्या रुग्णाची सध्याची वैद्यकीय स्थिती, अपरिचित वैद्यकीय संज्ञा, सुचविलेली शस्त्रक्रिया, पर्यायी उपचार, फायदे व संभाव्य धोके याबाबत डॉक्टरांना प्रश्न विचारण्याची संधी मला देण्यात आली असून माझ्या सर्व शंका समाधानकारकपणे दूर करण्यात आल्या आहेत.
                </li>

                <li>
                    वरील सर्व माहिती मला समजेल अशा भाषेत व आवश्यकतेनुसार चित्रांच्या साहाय्याने समजावून सांगण्यात आली आहे.
                </li>

                <li>
                    मला व माझ्या नातेवाईकांना सांगितलेले उपचार, त्यांचे फायदे तसेच शस्त्रक्रियेदरम्यान किंवा त्यानंतर उद्भवू शकणारे सौम्य, मध्यम किंवा गंभीर धोके (मृत्यूसह) मला मान्य आहेत.
                </li>

                <li>
                    तज्ज्ञ डॉक्टरांनी सर्व वैद्यकीय नियम व मार्गदर्शक तत्त्वांचे पालन करून उपचार केले तरी अपेक्षित परिणामांची हमी देता येत नाही, याची मला जाणीव आहे.
                </li>

                <li>
                    शस्त्रक्रियेदरम्यान किंवा त्यानंतर उद्भवणाऱ्या संभाव्य गुंतागुंतींसाठी मी रुग्णालय, डॉक्टर किंवा सहाय्यक वैद्यकीय कर्मचाऱ्यांना जबाबदार धरणार नाही.
                </li>

                <li>
                    मी हे संमतीपत्र पूर्णपणे स्वेच्छेने, कोणत्याही दबावाशिवाय व प्रभावाखाली न येता स्वाक्षरी करून देत आहे.
                </li>
            </ul>
            मी या संमतीपत्राद्वारे डॉ. <span><SignaturePad width={300} height={40} design="line" /></span> तसेच त्यांच्या सहाय्यक डॉक्टरांना वरील नमूद शस्त्रक्रिया करण्यास माझी संमती देत आहे.
        </div>
    )
}

export default PatientSurgeryDeclaration;