import React from "react";
import SignaturePad from "../SignaturePad";

function HaemodialysisMar() {
    return (
        <div>
            <p className="paragraph">
                <b>
                    रुग्ण / रुग्णाच्या नातेवाईक यांचे संमतीपत्र
                </b>
                <br />
                डॉक्टरांनी मला समजावून सांगितलेल्या खालील बाबी मला समजल्या असून त्या मला मान्य आहेत.
                <ul>
                    <li>
                        माझी / माझ्या रुग्णाची सध्याची वैद्यकीय स्थिती, रोगाचे स्वरूप,
                        रोगाचे भावी परिणाम व प्रतिसाद, तसेच माझी / माझ्या रुग्णाची
                        प्रकृतीसंबंधित धोके याबद्दल कल्पना दिली आहे.
                    </li>

                    <li>
                        माझे / माझ्या रुग्णाचे मूत्रपिंड तात्पुरते कार्य करीत नसल्यामुळे
                        मला / माझ्या रुग्णावर डायलेसिस करणे आवश्यक आहे. ही अडचण
                        तात्पुरत्या स्वरूपाची किंवा कायमस्वरूपी असू शकते.
                    </li>

                    <li>
                        हेमोडायलेसिस ही एक जीवनास आधार देणारी प्रक्रिया आहे.
                        मूत्रपिंड पुन्हा स्वस्थ होण्याची शक्यता नाही.
                    </li>

                    <li>
                        हेमोडायलेसिसमध्ये, नळ्या आणि / किंवा सुया किंवा एखादा कॅथेटर
                        माझ्या शिरेमध्ये आणि फिस्टुलामध्ये टाकून माझ्या रक्ताचे
                        शुद्धीकरण मशीनद्वारे केले जाईल.
                    </li>

                    <li>
                        उपकरणाचे पुरेसे कार्य आणि उपचार प्रभावी करण्यासाठी मला /
                        माझ्या रुग्णाच्या रक्त चाचण्या व इतर रेडिओलॉजीच्या तपासण्यांची
                        आणि सर्जिकल प्रक्रियांची आवश्यकता राहील.
                    </li>

                    <li>
                        सुचविलेल्या उपचारपद्धतीचे स्वरूप, हेतू व आवश्यकता, परिणाम,
                        फायदे आणि हानी, उपलब्ध विविध पर्याय व त्यांचे संभाव्य फायदे
                        आणि धोके तसेच सदर उपचार न केल्यास होणाऱ्या संभाव्य धोक्यांची
                        कल्पना मला दिली आहे.
                    </li>

                    <li>
                        हेमोडायलेसिसचा पर्याय पेरिटोनियल डायलेसिस किंवा प्रत्यारोपण आहे
                        आणि जेव्हा मी हे पर्याय निवडेन तेव्हा माझी / माझ्या रुग्णाची
                        त्या अनुषंगाने तपासणी केली जाईल.
                    </li>

                    <li>
                        आहारातील विशिष्ट निर्बंधांचे पालन करणे फार महत्त्वाचे आहे.
                        तसे न केल्यास हाडांचा रोग होऊ शकतो, हृदयाच्या झडपा,
                        रक्तवाहिन्या आणि त्वचा कडक होऊन हृदयविकाराचा झटका
                        आणि अगदी अचानक मृत्यू होऊ शकतो.
                    </li>

                    <li>
                        माझ्या डॉक्टरांनी सांगितल्याप्रमाणे औषधे घेणे आवश्यक आहे.
                    </li>

                    <li>
                        हेमोडायलेसिसच्या यशस्वीतेसाठी मी मशीनवर निर्धारित कालावधीसाठी
                        राहण्यास सहमत आहे व यावर माझे / माझ्या रुग्णाचे रक्त शुद्ध
                        होईल हे अवलंबून आहे.
                    </li>

                    <li>
                        हे उपचार चालू असताना जर अचानक माझ्या / माझ्या रुग्णाच्या
                        जीवाला धोका उद्भवल्यास, रुग्णाचा जीव वाचविण्याचे सर्व प्रयत्न
                        केले जातील.
                    </li>

                    <li>
                        वैद्यकीय व सहाय्यक वैद्यकीय कर्मचारी रुग्णाच्या हितासाठी
                        त्यांना असलेल्या ज्ञान, कौशल्याचा कार्यकुशलतेने वापर करतात.
                    </li>
                </ul>
            </p>

            <br /><br />

            <p className="paragraph">
                <b>मी नमूद करतो की,</b><br />
                <ul>
                    <li>
                        सदर संमतीपत्र वाचून व समजून घेण्यासाठी मला पुरेसा वेळ देण्यात आलेला आहे.
                    </li>

                    <li>
                        माझी / माझ्या रुग्णाची सध्याची वैद्यकीय स्थिती, अपरिचित वैद्यकीय
                        परिभाषा, सुचविण्यात आलेल्या उपचारांचे परिणाम, फायदे व हानी,
                        उपलब्ध विविध पर्याय व त्यांचे संभाव्य फायदे आणि धोके याबाबत
                        डॉक्टरांना प्रश्न विचारण्याची संधी मला देण्यात आली आहे आणि
                        माझ्या शंका व प्रश्नांची पूर्णतः समाधानकारक उत्तरे देण्यात आली आहेत.
                    </li>

                    <li>
                        वरील मजकूर मला समजेल अशा भाषेत व आवश्यक त्या ठिकाणी
                        रेखाचित्रांद्वारे समजावून सांगितला आहे व तो मला पूर्णतः समजला आहे.
                    </li>

                    <li>
                        मला / माझ्या नातेवाईकांना सांगितलेले उपचार, संभाव्य फायदे तसेच
                        उपचारादरम्यान होऊ शकणारे सौम्य, मध्यम किंवा तीव्र प्रकारचे
                        जीवितास धोके मला मान्य आहेत.
                    </li>

                    <li>
                        वरील नमूद उपचारादरम्यान किंवा नंतर उद्भवू शकणाऱ्या संभाव्य
                        दुष्परिणामांसाठी मी रुग्णालय, वैद्य किंवा सहाय्यक वैद्यकीय
                        कर्मचाऱ्यांना जबाबदार धरणार नाही.
                    </li>

                    <li>
                        सदरच्या संमतीपत्रावर मी पूर्णतः स्वेच्छेने व कोणत्याही दबावाखाली
                        न येता स्वाक्षरी करत आहे.
                    </li>

                    <li>
                        मी सदर संमतीपत्राद्वारे
                        डॉ. <span><SignaturePad width={300} height={40} design="line"/></span> 
                        यांच्या मार्गदर्शनाखाली हेमोडायलिसिस करण्याची संमती देत आहे.
                    </li>
                </ul>
            </p>
        </div>
    )
}

export default HaemodialysisMar;