import React from "react";
import SignaturePad from "../CommonCode/SignaturePad";
import Table_Form from "../CommonCode/Tabel_Form";
import "../CommonCode/FormBasic.css";
import PatientDeclaration from "./PatientDeclaration";



function EyeMar() {


    return (
        <div className="consent-form">
            <h2 className="title" >
                श्रद्धा हॉस्पिटल, दौंड
            </h2>
            <h4 className="title">
                नेत्र शस्त्रक्रियेसाठी संमतीपत्र <br /> (Eye Consent)
            </h4>

            <Table_Form />
            <div>
                <div>

                    <p className="paragraph">
                        मोतीबिंदू या विकाराला या घटकेपर्यंत शस्त्रक्रियेखेरीज दुसरा उपाय नाही. मला मोतीबिंदू / काचबिंदू शस्त्रक्रियेबाबत सर्व कल्पना देण्यात आली आहे. मोतीबिंदूचे
                        ऑपरेशन नजर सुधारण्यासाठी केले जाते तर काचबिंदूच्या ऑपरेशनद्वारे नजर टिकविण्याचा प्रयत्न केला जातो.
                        कोणतीही शस्त्रक्रिया संपूर्णपणे निर्धोक नसते. यामध्ये क्वचित प्रसंगी गुंतागुंत (Complications) उद्भवण्याची शक्यता असते. <br /><br />
                        <ul className="paragraph">
                            <li>
                                उदाहरणार्थ –
                            </li>


                            <ol>
                                <li>
                                    पडदा सरकणे.
                                </li>

                                <li>
                                    डोळ्यात रक्तस्त्राव होणे, अपेक्षेपेक्षा कमी दिसणे.
                                </li>

                                <li>
                                    डोळ्यांचा ताण (Pressure) वाढणे.
                                </li>

                                <li>
                                    जंतूंचा संसर्ग होणे.
                                </li>

                                <li>
                                    लेन्स आत सरकणे.
                                </li>

                                <li>
                                    टाका घ्यावा लागणे.
                                </li>

                                <li>
                                    मोतीबिंदूचा काही भाग ऑपरेशनच्या वेळी काढता न येणे.
                                </li>

                                <li>
                                    डोळ्याच्या बाहुलीला / बुबुळाला सूज आल्यास ती कमी करण्यासाठी डोळ्यात इंजेक्शन द्यावे लागू शकते.
                                </li>
                            </ol>
                            <br />
                            वरील बाबींची शक्यता ब्लडप्रेशर आणि डायबेटीस किंवा इतर शारीरिक व्याधी असणाऱ्या, तसेच चष्म्याचा मोठा नंबर असणाऱ्या रुग्णांमध्ये जास्त असते.
                            तसेच क्वचित प्रसंगी रुग्णांना ऑपरेशनच्या वेळी मानसिक तणावामुळे ब्लडप्रेशर वाढून अर्धांगवायूचा झटका येऊ शकतो किंवा शारीरिक व्याधींमुळे
                            अतिदक्षता विभागात हलवावे लागू शकते. क्वचित प्रसंगी लघवीला अडथळा येऊ शकतो.
                            <br /><br />

                            <li>
                                <b>९५% रुग्णांना मोतीबिंदूच्या ऑपरेशननंतर चष्मा लागतो. चष्म्याचा नंबर शस्त्रक्रियेनंतर सुमारे १ ते २ महिन्यांनी दिला जातो.</b>
                                <br />
                                <ul>
                                    <li>
                                        ए-स्कॅन उपकरणाद्वारे घेतले जाणारे कृत्रिम भिंगाचे माप अंदाजे असते.
                                    </li>
                                </ul>
                            </li>
                            <br />

                            <li>
                                १५% रुग्णांना ऑपरेशननंतर लेसरचा शेक (YAG LASER) देण्याची गरज पडते. त्यासाठी ₹१५००/- वेगळा खर्च येतो.
                            </li>
                            <br />

                            <li>
                                काही रुग्णांमध्ये डायबेटीसमुळे (Diabetic Retinopathy), ब्लडप्रेशरमुळे व वयानुसार होणाऱ्या दृष्टीपटलाच्या विकारांमुळे (AMD)
                                मोतीबिंदूच्या ऑपरेशननंतरही दृष्टी कमी असू शकते. त्याचा लेन्स व मोतीबिंदूच्या ऑपरेशनशी काहीही संबंध नसतो. त्यासाठी
                                दृष्टीपटलाचा वेगळा उपचार करावा लागतो.
                            </li>
                            <br />
                            या हॉस्पिटलमध्ये होणाऱ्या ऑपरेशनच्या पद्धतींची माहिती मला समजेल अशा भाषेत देण्यात आली आहे.
                            मी माझ्या मर्जीनुसार <span><SignaturePad width={300} height={30} design="line" /></span>
                            पद्धतीचे ऑपरेशन करण्याचे ठरविले आहे.मी निवडलेल्या शस्त्रक्रियेसाठी अंदाजे रु.
                            <span><SignaturePad width={300} height={30} design="line" /></span> खर्च येईल. शस्त्रक्रियेनंतर
                            आवश्यकतेनुसार खर्चामध्ये बदल होण्याची शक्यता असते, याची मला कल्पना आहे. <br />
                            <br />
                            <PatientDeclaration  
                            showAnother={true}
                            dateName="शस्त्रक्रियेची तारीख"
                            typeDate="date"
                            />
                            <br />

                            <li>
                                मला माहितीपत्रक देण्यात आलेले आहे.
                                <ul>
                                    <li>
                                        ऑपरेशनपूर्वी व ऑपरेशननंतर घ्यावयाच्या काळजीबाबत डॉक्टरांनी मला आवश्यक सूचना
                                        दिलेल्या आहेत व त्या मला पूर्णपणे समजल्या आहेत.
                                    </li>

                                    <li>
                                        ऑपरेशनच्या दिवशी हॉस्पिटलमध्ये आल्यानंतर मी संमतीपत्रावर स्वखुशीने सही करेन.
                                    </li>
                                </ul>

                            </li>
                        </ul>
                    </p>
                </div>
                <PatientDeclaration  
                    showAnother={false}
                    dateName="दिनांक व वेळ"
                    typeDate="datetime-local"
                />

            </div>
        </div>
    )
}

export default EyeMar;