import React from "react";
import Table_Form from "../Tabel_Form";
import SignaturePad from "../SignaturePad";
import "../Minor_Surgical/MinorEnglish.css";
import FormChart from "../Common_Code/FormChart";
import Stamp from "../../../../assets/Uretero.png"



function UreteroMar() {
    return (
        <div className="consent-form">
            <h2 className="title" >
                श्रद्धा हॉस्पिटल, दौंड
            </h2>
            <h4 className="title">
                मूत्रमार्गाची दुर्बिणीद्वारे तपासणी आणि / किंवा तपासणीसाठी ऊतीचा नमुना (बायोप्सी) घेण्यासाठी सूचित संमतीपत्र
            </h4>

            <p className="title">
                (डॉक्टरांनी प्रक्रियेबाबत सविस्तर माहिती समजावून सांगितल्यानंतर रुग्ण / रुग्णाचे नातेवाईक आणि डॉक्टर यांनी स्वाक्षरी करावयाची आहे.)            </p>

            <Table_Form />
            <div>

                <label >
                    <div>
                        <div style={{ display: "flex", justifyContent: "space-between" }}>
                            <b>पूर्व निदान :</b> <span><SignaturePad width={260} height={30} design="line" /></span>
                            <b>भुलेचा प्रकार :</b> <span><SignaturePad width={260} height={30} design="line" /></span>
                        </div>
                        <br />


                        <div style={{ display: "flex", justifyContent: "space-between" }}>
                            <p ><b>शस्त्रक्रियेचे नाव :</b> मूत्रमार्गाची दुर्बिणीद्वारे तपासणी (यूरेट्रोस्कोपी) <br />आणि / किंवा मूत्रमार्गाद्वारे मूत्रवाहिनीतील खडा काढण्याची शस्त्रक्रिया.</p>
                            <p ><b>बाजु :</b> <span><SignaturePad width={300} height={30} design="line" /></span></p>
                        </div>
                    </div>
                </label>

                <b>मूत्रमार्गाची दुर्बिणीद्वारे तपासणी आणि / किंवा तपासणीसाठी ऊतीचा नमुना (बायोप्सी) घेण्याची शस्त्रक्रिया :</b>
                या प्रक्रियेमध्ये दुर्बिणीद्वारे मूत्रवाहिनी (युरेटर) व मूत्रपिंड (किडनी) यांची अंतर्गत तपासणी केली जाते. आवश्यक
                असल्यास मूत्राचा प्रवाह सुरळीत ठेवण्यासाठी तात्पुरत्या स्वरूपात प्लास्टिक ट्यूब (स्टेंट) बसविली जाऊ शकते.
                ही प्रक्रिया सिस्टोस्कोपी (मूत्राशयाची दुर्बिणीद्वारे तपासणी) व रेडिओलॉजिकल इमेजिंगच्या साहाय्याने केली जाते.
                तसेच आवश्यकतेनुसार तपासणीसाठी ऊतीचा नमुना (बायोप्सी) घेतला जाऊ शकतो.


                <br /><br />

                <div>
                    <img
                        src={Stamp}
                        width="750"
                        height="300"
                        alt="Stamp"
                    />
                </div>
                <br /><br />

                <b>शस्त्रक्रियेचे फायदे</b>
                <br />
                <ul>
                    <li>मूत्रवाहिनी (युरेटर) व मूत्रपिंड (किडनी) यांमधील विकृती, अडथळा किंवा आजाराचे निदान करण्यासाठी.</li>
                    <li>निदानानुसार योग्य उपचार (चिकित्सा) करण्यासाठी.</li>
                </ul>
                <br /><br />

                <b>संभाव्य धोके :-</b>  <br />
                <ul>
                    <li><b style={{ fontWeight: "600", fontSize: "12px" }}>सामान्य</b></li>
                    <ul>
                        <li>शस्त्रक्रियेनंतर काही काळ लघवी करताना जळजळ होणे किंवा थोड्या प्रमाणात रक्त येणे.</li>
                        <li>तात्पुरत्या स्वरूपात मूत्राशयात कॅथेटर (नळी) बसवावी लागू शकते.</li>
                        <li>युरेट्रिक स्टेंट बसवावा लागू शकतो व तो काढण्यासाठी पुढील प्रक्रिया करावी लागू शकते.</li>
                        <li>निदान प्रक्रिया यशस्वी झाल्यानंतरही आजार पूर्णपणे बरा होईल याची हमी देता येत नाही.</li>


                    </ul>
                    <br /><br />

                    <li><b>नैमित्तिक</b></li>
                    <ul>
                        <li>मूत्रपिंडाचा संसर्ग किंवा कार्यक्षमता कमी झाल्यास पुढील उपचारांची आवश्यकता लागू शकते.</li>
                        <li>मूत्रवाहिनी (युरेटर) अरुंद असल्यास दुर्बिणीद्वारे तपासणी करणे शक्य न होण्याची शक्यता असते.</li>
                    </ul>
                    <br /><br />

                    <li><b>दुर्मिळ</b></li>  <br />
                    <ul>
                        <li>कर्करोग (कॅन्सर) आढळल्यास पुढील अतिरिक्त उपचार किंवा शस्त्रक्रियेची आवश्यकता लागू शकते.</li>
                        <li>मूत्रवाहिनीला इजा झाल्यास खुली शस्त्रक्रिया (ओपन सर्जरी) करावी लागू शकते किंवा पाठीमागून मूत्रपिंडात कृत्रिम नळी (नेफ्रोस्टॉमी ट्यूब) बसवावी लागू शकते.</li>
                    </ul>
                    <br /><br />

                    <li><b>अतिदुर्मिळ</b></li>  <br />

                    <ul>
                        <li>
                            मूत्रवाहिनीमध्ये व्रण (Scar) तयार होणे किंवा अडथळा निर्माण होणे, ज्यासाठी पुढील प्रक्रिया किंवा उपचारांची आवश्यकता लागू शकते.
                        </li>
                    </ul>
                    <br /><br />

                    <li><b>पर्यायी उपचार पद्धती</b></li>  <br />
                    <div className="d-flex flex-column gap-2" style={{ marginLeft: "20px" }}>
                        <div>
                            <input type="checkbox" className="form-check-input me-2" />
                            <label>पर्यायी उपचार पद्धती खुली शस्त्रक्रिया (ओपन सर्जरी / पोट उघडून शस्त्रक्रिया).</label>
                        </div>

                    </div>
                </ul>
                <br /><br />

                <b>रुग्ण / रुग्णाचे नातेवाईक यांचे संमतीपत्र</b> <br />
                डॉक्टरांनी मला समजावून सांगितलेल्या खालील बाबी मला समजल्या असून त्या मला मान्य आहेत.
                <ul className="paragraph">
                    <li>
                        माझी / माझ्या रुग्णाची सध्याची वैद्यकीय स्थिती, रोगाचे स्वरूप, रोगाचे संभाव्य परिणाम व प्रतिसाद, तसेच प्रकृतीसंबंधित धोके यांची मला माहिती देण्यात आली आहे.
                    </li>

                    <li>
                        ही शस्त्रक्रिया साधारण, स्थानिक किंवा प्रादेशिक भूल स्वतंत्रपणे अथवा संयुक्तपणे देऊन केली जाऊ शकते. भुलीसाठी स्वतंत्र संमतीपत्र घेण्यात आले आहे.
                    </li>

                    <li>
                        सुचविलेल्या शस्त्रक्रियेचे स्वरूप, उद्देश, आवश्यकता, संभाव्य परिणाम, फायदे, जोखीम, उपलब्ध पर्यायी उपचार पद्धती तसेच शस्त्रक्रिया न केल्यास उद्भवू शकणारे धोके यांची माहिती मला देण्यात आली आहे.
                    </li>

                    <li>
                        आवश्यक असल्यास उद्भवलेल्या समस्यांचे निराकरण करण्यासाठी पुन्हा शस्त्रक्रिया करावी लागू शकते, याची मला कल्पना देण्यात आली आहे.
                    </li>

                    <li>
                        शस्त्रक्रियेदरम्यान अनपेक्षित परिस्थिती निर्माण झाल्यास, रुग्णाचा जीव वाचविण्यासाठी किंवा योग्य उपचारासाठी मूळ नियोजित शस्त्रक्रियेव्यतिरिक्त इतर किंवा नवीन शस्त्रक्रिया व उपचार करावे लागू शकतात अथवा शस्त्रक्रिया थांबवावी लागू शकते.
                    </li>

                    <li>
                        रुग्णाची सध्याची वैद्यकीय स्थिती, तपासण्या, संभाव्य निदान व वैद्यकीय सल्ल्याबाबत मला समजावून सांगण्यात आले आहे.
                    </li>

                    <li>
                        शस्त्रक्रियेदरम्यान किंवा त्यानंतर इतर कोणत्याही रोगाचे निदान होऊ शकते. तसेच काही आजार शस्त्रक्रियेद्वारे पूर्णपणे बरे होऊ शकत नाहीत किंवा प्रगत अवस्थेत असल्याचे आढळू शकते.
                    </li>

                    <li>
                        भविष्यात हा रोग पुन्हा उद्भवण्याची किंवा शरीराच्या इतर भागात पसरण्याची शक्यता असू शकते.
                    </li>

                    <li>
                        शस्त्रक्रियेशी संबंधित धोके किंवा गुंतागुंत उद्भवल्यास, आवश्यकतेनुसार मोठ्या रक्तवाहिनीद्वारे औषधे देणे, अतिदक्षता विभागात (ICU) उपचार करणे किंवा कृत्रिम श्वसनयंत्राची आवश्यकता भासू शकते.
                    </li>

                    <li>
                        उपचार सुरू असताना अचानक जीवाला धोका निर्माण झाल्यास, रुग्णाचा जीव वाचविण्यासाठी सर्व आवश्यक प्रयत्न केले जातील.
                    </li>

                    <li>
                        वैद्यकीय व सहाय्यक वैद्यकीय कर्मचारी रुग्णाच्या हितासाठी त्यांचे ज्ञान, कौशल्य व अनुभव यांचा योग्य वापर करतील.
                    </li>

                </ul>

                <br /><br />

                <b>मी नमूद करतो की,</b>  <br />
                <ul className="paragraph">
                    <li>
                        सदर संमतीपत्र वाचण्यासाठी व समजून घेण्यासाठी मला पुरेसा वेळ देण्यात आला आहे.
                    </li>

                    <li>
                        माझी / माझ्या रुग्णाची सध्याची वैद्यकीय स्थिती, अपरिचित वैद्यकीय संज्ञा, सुचविलेली शस्त्रक्रिया, उपलब्ध पर्याय, फायदे व संभाव्य धोके याबाबत डॉक्टरांना प्रश्न विचारण्याची संधी मला देण्यात आली असून माझ्या सर्व शंकांचे समाधानकारक निरसन करण्यात आले आहे.
                    </li>

                    <li>
                        वरील माहिती मला समजेल अशा भाषेत व आवश्यकतेनुसार चित्रांच्या सहाय्याने समजावून सांगण्यात आली आहे.
                    </li>

                    <li>
                        मला व माझ्या नातेवाईकांना सांगितलेले उपचार, त्यांचे संभाव्य फायदे तसेच शस्त्रक्रियेदरम्यान किंवा त्यानंतर उद्भवू शकणारे सौम्य, मध्यम किंवा गंभीर धोके (मृत्यूसह) मला मान्य आहेत.
                    </li>

                    <li>
                        तज्ज्ञ डॉक्टरांनी सर्व वैद्यकीय नियम व मार्गदर्शक तत्त्वांचे पालन करून उपचार केले तरी अपेक्षित परिणामांची हमी देता येत नाही, याची मला जाणीव आहे.
                    </li>

                    <li>
                        शस्त्रक्रियेदरम्यान किंवा त्यानंतर उद्भवणाऱ्या संभाव्य गुंतागुंतींसाठी मी रुग्णालय, डॉक्टर किंवा सहाय्यक वैद्यकीय कर्मचाऱ्यांना जबाबदार धरणार नाही.
                    </li>

                    <li>
                        मी हे संमतीपत्र पूर्णपणे स्वेच्छेने, कोणत्याही दबावाशिवाय व प्रभावाखाली न येता स्वाक्षरी करून देत आहे.
                    </li>
                </ul>
                मी या संमतीपत्राद्वारे डॉ. <span><SignaturePad width={300} height={40} design="line"/></span> तसेच त्यांच्या सहाय्यक डॉक्टरांना वरील नमूद शस्त्रक्रिया करण्यास माझी संमती देत आहे. 

            </div>
            <FormChart showInterpreterDeclaration={false} />
        </div>
    )
}

export default UreteroMar;
















